{
  "Subreddit Name": "aww",
  "Submissions": [
    {
      "Score": 4202,
      "Comments": [ null, "Why?", "Some people prefer this style of interaction.  We've had the server for a while, this is just a reminder that it exists.", "Did you see my DM?", "You should send a modmail instead of a DM.", "Not to bother you again but it seems FMR has a broken mod mail.", "money", "[removed]", "[removed]", "You should Dm me", "[removed]", "[removed]", ">Why?", ">Some people prefer this style of interaction.  We've had the server for a while, this is just a reminder that it exists.", "I'd prefer if the mods spent their time actually enforcing the rules so we don't have 40 dead pet posts on the front page every day", "Agreed", "What, you don't want to be able to see people type, \"CUTE!\" \"Squee!\" and \"Hooman\" in real time? You don't want to get personally acquainted with dozens of 11 day old accounts that will be promptly sold to bots? \n\nKilljoy.", "^ Vale gets it. Upvote for reality.", "Yay", ">I'd prefer if the mods spent their time actually enforcing the rules so we don't have 40 dead pet posts on the front page every day", "So people can scream AWW", "Yes.. We love to scream AWWW", "Por que?  I mean, it's so great!", "Yes why not!", "money", "To say \"aww\"", ">Some people prefer this style of interaction.  We've had the server for a while, this is just a reminder that it exists.", "Yay", "Hey I love your dogs", "So I can be told how I am owning an animal wrong live? NEXT", "It's for a subreddit honey!  NEXT!", "[removed]", "Welcome to AWWWW", "Why?", "sooo Cute!", "Awww such a cute discord server!", "Very cute", " What, you don't see people typing \"CUTE\". \"Pressure!\" And \"Human\" in real time? You don't want to be personally acquainted with a dozen 11-day-old accounts that will be sold to bots right away?", "u/AAVale ?", "Oh that's pretty ironic, lol.", "Why?", "Nice", "O", "Sigmund would be a great name—I agree!!", "Hey I love your dogs", "What is ur discord server name", "Like anybody knows what that is.", "You’re literally the only one who doesn’t know", "Which is what makes it funny.", "What is a discord server please?", "What's the code for this server? The link takes us to a discord.com site saying I got an invite from the server (as it should), but I'm pressing accept invite and it won't respond.", "If you're using a mobile app, try copying the link, and then adding it within the app.", "It won't let me click the link when I open the browser link either.", "great", "Well done", "https://www.reddit.com/r/aww/comments/i9m174/my_cat/?utm_medium=android_app&utm_source=share", "Finally :D", "Unable to post anything", "Holy shit.", "Cute!", "what is he doing?eating something?", "????", "awww soo cute :)", "so cool", "I don’t know what this means. Is it good or bad, and is it going to cost me anything?", "It means that r/aww has opened a chat-type account on Discord for folks who want to join...", "cool", "AWWWWWWWWW, THIS IS PERFECT, WE CAN NOW GIVE THEM CUTE EMOS!", "[removed]", "discord is officially blessed", "nice, is so beautiful.", "Nicee", "Not you", " Well done", "lolol", "Awesome", "It's very cut pet", "Nice", "YEAS, THATS GREAT I THINK", "nice", "fishy fish", "So cute", "My heartb?", "people can say AWW and we are talking about  **server** :D", "????", "AHHH", "How did the old dark jokes moderator get on the aww subreddit?", "I don't understand", "Cute", "Love", "Wow", "Could you tell me the code? Im on mobile and it doesnt let me join by clicking links like this", "aww", "Ahh", "ok", "Why?", "Cool", "ok", "very nice post", "Awwww", "Cuteeeeeeee", "I just saw this and I wanna know why heh?", "That's amazing", "That’s awwsome", "u/SnootyScraper !xpost", "haha", "i like it.", "Wow nice kitten", "Cute Elephant baby", "[removed]", "aww", "Awh so cute", "joining!!", "???????????‍????‍??????????????????????????????????????‍?????????????????????????", "now I need a Discord app...", "Funny animals and cute ???", "?", "Ghuuuy", " I'd prefer if the mods spent their time actually enforcing the rules so we don't have 40 dead pet posts on the front page every day", "you almost have 3 million karma... i think it’s time you hit the showers, ill show you around", "Great idea", "His name was Ned", "Nice imma head over", "Mods, you should ban fake/photoshopped posts.", "Hello I can't post for some reason idk why tho", "Why" ],
      "Id": "hyts0n",
      "Submission Name": "r/aww has a Discord server"
    },
    {
      "Score": 148,
      "Comments": [ null, "**Congrats, /r/brushybrushy!**\n\n____\n\nIf you know of a good subreddit with more than 1,000 subscribers to be the /r/aww subreddit of the week, feel free to leave a suggestion below.\n\nTo see past /r/aww subreddits of the week, check out this link:\n\nhttps://www.reddit.com/r/aww/wiki/awwwsuboftheweek", "r/DontPlayWithThat! We’d be so grateful if you featured our little sub. We think your audience will find our content cute/funny!", "/r/ScratchyScratchy\n\nThe subreddit was made based off the theme of brushybrushy  :)", "Congrats!!!" ],
      "Id": "ln5ne6",
      "Submission Name": "/r/BrushyBrushy: /r/aww Subreddit of the Week"
    },
    {
      "Score": 81368,
      "Comments": [ null, "This will be back under the stove absolutely immediately", "The trick to NOT having it back under there is to drop the newly retrieved toy in another room.\n\nThat at least gives you a few minutes.", "lol my cat loves ‘getting under a couch’ part the most about any toy. \n\nHe grabs the toys if they are in another room, sets them near his favorite couch and pushes them under. He then likes to reach it under the couch and try to get it back or push towards another opening. If he succeeds, the circle starts over until a time he can’t reach it and pretend that he never wanted it back anyway.", "I saw a video on Twitter of a cat going in the bathroom, passing by his toy lying on the bathroom floor, going behind the door it's next to, and swiping at the toy through the little space between the door and floor. (Hopefully that's a good description and you can picture it)", "Yup, my cats do this plenty, they also do it to play with each other.", "Have you seen that YouTube video of Kitty Bank where the cats owners get sucked underneath. Its cute. You should look it up.", "That was a great description.", "I know exactly which video you are talking about.", "My dog is the same way. He is the proudest little hunter so he likes to challenge himself by pushing it just out of reach or getting it jammed somewhere (though when we are at my mom's house, his favorite thing is dropping his ball down the stairs and chasing it before it gets to the bottom). Little guy was born with no eyes so he loses it a lot. He's normally pretty good, but I just think he underestimates how far it can go and he doesn't get the concept of depth. But he will cry and cry until we get it for him. I would do anything for him but god he's annoying sometimes!", "I’m blind as a bat, but I can hear like a fox! Get him a toy that is made fir a cat. They tend to have a high pitched jingle. Also tissue paper loosely blocking these obstacles would help as long as it doesn’t restrict the utility airflow", "Dog tax!!", "Oh my gosh the paw on top of the other cat <4", "My cat does the same. One day I was wondering where all his toys went but then a few days ago I finally looked under the couch and they were all there like 6+ toys. Silly little guy", "[Reminded me of this post I saw a while back](https://i.imgur.com/Y7CTE4l.jpg)\n\n\nTop comment on Imgur: \n\n\"Please don't take them. They're all I have in this world.\" - Cat probably.\n\nSource: https://imgur.com/gallery/5RiIotI", "I prefer to stick a curtain rod along the front edge of the stove. They still manage to lose them other places but not under the stove.", "We put a wooden bar under the stove. Prevents us from having to dig it out.", "> We put a wooden bar under the stove. Prevents us from having to dig it out\n\nany self respecting golden retriever puppy would eat that piece of wood as a teething snack; then bring what is left to you and drop it at your feet.", "We specifically bought a stove that was closer to the floor... the hutch... still gets toys under it", "I try that, but with linoleum down in the kitchen the toys slide about better than on a carpet so they just take them straight back into the kitchen", "\"Even though my arm is draped over you in a thinly veiled attempt to display solidarity with my brethren during this emotional toy retrieval, it's actually because I plan on holding you down when the toy comes out\"", "This is the exact reason I started buying larger toys for my cats.", "I bought a yard stick that I put under there. No toys under the stove since and you can't even see it.", "Excellent idea!\n\nI will have to try it.", "My dog Tank puts his ball under stuff just to watch you get on the floor to retrieve it. He has us well trained.", "My dog is blind and gets so excited that he will start batting furiously trying to get it and realizing we are helping him and he ends up just smacking our heads!", "Your dog sounds super adorable lol.", "I cut one side off of a plastic door sweep to put underneath the front of my oven, can't see it at all and nothing goes underneath now.", "What's a \"plastic door sweep\"???????", "It's a U shaped plastic piece you slide onto the bottom of a door to keep the cold/insects out. Most of them have a brush kind of thing but this one did not.", "Huh.  I did not know. Thnx!", "And there it is\n\n\n*thwap* \n\n\nDamn...", " **This reminds me of my cat Henry. He was forever losing his mice and when I'd ask him where his toys were, he'd go look under the couch or the stove or the closet door so I could rescue them.**", " My cat, [Pippin](https://imgur.com/gallery/BtqfMVp), did that with her pack of crackers the other day", "My cat did this all the time as a game. She’d bring the toy, drop and hit under furniture. She would then cry frantically until I got it out and would do it all over again. In the middle of the night. Bless her little heart.", "Teamwork!", "“We have mom playing now too!”", "?", "So cute. Love how one is hugging the other. Hope they got their toy back!", "This is a renaissance painting ready to be made if I ever saw one involving two cats, a fridge and a human trying to retrieve the toy.", "oven", "Wondered why you said oven but I totally missed that the other dude said fridge", "I'm here for the people", "But those are cats", "I'm here for the cats.", "Someday, the government will stop taking kick-backs from BIG APPLIANCE, and we will finally get our oven/fridges we have all been waitng for!", "Me:  \"This is a renaissance painting ready to be made if I oven saw one involving two cats, a fridge--oh, I'm an idiot.\"", "Completely forgot refrigerators didn't happen in the renaissance era.", "this is true but also it's just an oven in the picture, not a fridge", "Toy-eating Box of Doom.", "pretty sure it’s a dishwasher", "Maybe you're joking but dishwashers don't usually have broilers at the bottom of them or glass windows", "someone turn the retrieval device into a tiny sword", "I think that's a screwdriver or a prong or something", "Post onto a Photoshop battle board and you'll be flooded with them!  Haha. Adorable pic", "r/accidentalrenaissance", "more /r/accidentalrockwell", "This is what I was thinking.", "Yes, Norman Rockwell's \"Anticipation.\" I can see it hanging on the wall now!", "Exactly 17 seconds later, they put it back under there.", "Meow", "Meow", "....meow.", "This is the way", "\"It's ok... Don't worry, human will get it. I've seen it done before!\"", "...and we’ll see it done again", "All of this haz happened before, and all of it will happen again... only this time under the oven.", "Yup. Only own a yard stick so I can retrieve toys from under the couch and stove.", "Hot tip on the stove: oftentimes the lower warming tray is relatively light and easy to remove by opening all the way and lifting out. I've recovered uncountable kid and critter treasures (so many milk jug tabs!) this way. No reaching devices needed!", "I never knew that was called a warming tray. I have always used it for storage. TDIL", "You mean that's NOT where you're supposed to store the cookie sheets??!", "We’re keeping them warm, I guess.", "Preheating them I guess. ??", "Legacy from gas ovens. The drawer was exposed to the flame, so it was the broiler. \"Warming tray\" is rather tame.", "We just moved into an apartment and my boyfriend used that term. I never knew it was used for anything besides storage for pots and pans before this.", "Mine doesn’t even have a bottom under the tray so you just pull it out and can see the floor underneath. Super easy to retrieve cat bullshit and runaway cereal pieces!", "“Super easy to retrieve cat bullshit” hahaha spoken like a true feline slave", "Thanks! I'll see if mine will come out.", "Mine comes out but then refuses to go back in.", "I need the conclusion to this narrative. What did you do, force it?", "Oh no you broke it", "I pull this out everytime I run my robot vacuum.", "Closet where my water heater and storage tank (I have a well) are for me. I've tried taping cardboard to the bottom of the door to block it off. Nope, cat finds a way to remove it and shove the crinklies into the closet regardless. Adorable fluffy asshole.", "Adorable fluffy asshole is the best description of a cat.", "Just pulled a toy mouse out from this closet in my apartment", "Yup. I use my very long bear claw back scratcher. I can’t even use it to scratch my back now because it’s touched the grossness of my under stove", "I purchased a yard stick to stick under the oven to block any toys from going under there. It works great.", "Oh my gosh the paw on top of the other cat <3", "it looks like he's just hindering his friend from being first at grasping it. cats are cunning lol", "\"Don't worry, Sterling, our human is a professional. You'll have that catnip toy back before you know it.\"\n\n\"Cooper man I'm fiendin' hard. I don't know how much longer I can stand it.\"\n\n\"Fuck's sake, Sterling.\"", "I love the names Sterling and Cooper. Now I wanna name my future dog Sterling instead of Lil Thanos.", "Mad Men reference I assume?", "Sterling as in silver, Cooper is close to copper. The cats are those colors. Also it's fun to give the *other* one a name that sounds good in the other's implied accent. Cooper is a mannered fellow who would say 'Sterling' with charming dignity, and Sterling is a streetwise dude at the end of his rope who might break syntax in a moment of desperation.", "I think there may be a market for you naming services... ;)", "r/worldbuilding", "R/writingprompts", "[My dog](https://i.imgur.com/rUb2c3z.jpg) was named Sterling and it fit him so well. He was the best boy for 13 amazing years. I miss him all the time.", "Is he a King Charles?", "Get a Dad dog and his daughter. Name them Thanos and Gamora. Make so many memes of him pushing her off stuff. ?", "Must make sure none of them are related and get a second girl. Don't let Nebula feel left out.", "Maybe I purposefully left her out.. (Nah I actually forget about her character all the time... Oops.) Lol.", "Do nit introduce your dog to Col. James Rhodes.\n\nEspecially when it's a puppy", "I have a cat named Sterling (gray cat) and a dog named Cooper (tan mutt)!", "I showed this to my cat, she had no reaction. This, from a feline who makes me retrieve her toys from under the fridge....\nI totally get this pic!!!", "Eh just human doing their job\n\n\n– your cat probably", "Pretty sure my cat refers to me as “the toy retriever” / “foodbringer” / “litterbox cleaning lady”", "Funny walking radiator with massaging option.", "That's my wife you're talking about!", "Something tells me this is not their first rodeo.", "This reminds me of my cat Henry. He was forever losing his mice and when I'd ask him where his toys were, he'd go look under the couch or the stove or the closet door so I could rescue them.", "some years ago my brother was in this internet video where a guy gets transported under the stove and it's like a bank for cat toys. He's the guy behind the desk.\n\n[https://www.youtube.com/watch?v=Tc2PVl4SqzI](https://www.youtube.com/watch?v=Tc2PVl4SqzI)", "This is awesome!  Thanks for sharing, if I understood the award system I'd give you one!", "My dog is the same except she gets her toys under the shelf the TV sits on and the couch.", "China hutch over here. Every time I get the yardstick out for a sweep you'd swear I just gave them new toys.", "Coffee table in the living room today for the first time.  I didn't think the toy could fit, and my arm certainly can't very far.  Thankfully the toy was \\*just\\* under the coffee table.  There was much relief on the dog's part.", "My dog is also the same, except he’s so eager to don’t miss the toy coming out that he insists on laying in front of me like a bulldozer tank while I do my very best trying to retrieve the toy which means that I a) can’t see shit and b) can’t retrieve the toy,", "Just the whining will get me to do this every time.", "my cat comes and tells me lmfao. Like she takes on an intense posture and sounds like shes literally asking me", "It’s the paw on the other kitty’s back, for me", "Pro tip: remove the entire warming drawer and the pull all the toys out (and vacuum out the cat hair dust bunnies that we both know are living under the oven).", "Oops I didn’t scroll enough to see this. ^ this, the drawer should be removable.", "My Dad’s cats used to do this. They’d get all the toys stuck under the fridge and then would wait until I came over and yell at me until I got their toys back.", "I watched this entirely too long before realizing that it was not a video.", "i know the feeling", "haha its going right back after", "lost my marbles", "r/accidentalrockwell", "awww", "lol", "that paw on the other back", "\"Get the maus so we may chase it once more, hooman!\"\n\nFive seconds later...\n\n\"Hooman! The maus again hides beneath the hawt metuhl bawks! Da coward! Da fool!\"", "[THEY HIDE IN THEIR METAL BAWKSES!](https://www.youtube.com/watch?v=cO3MttgvHUY)", "Yess :D", "That cat looks cute with their arm on their little friend but in reality its leverage so when the toy appears Orange can get it first.", "Im gonna get it ... nope Im gonna... no way im gonna... no way!! LOL", "Very beautiful cats", "But did you retrieve it?", "Wish I could give you 2 upvotes for making me smile! I love this!\n\nBTW what else did you find under there?", "Oh man, I totally get this pic as I was trying to retrieve my cats toys from under the fridge while they watch on..", "Been there done that. The sofa is fun too! Lots of prizes there.", "My cat does the same when I have to get all of my hair ties from under the sink cabinet.", "I was doing the same thing a couple weeks ago and out from underneath the stove I flung a live mouse out! My three dogs went crazy trying to get it. The mouse made it into the living room and hide behind the heavy oak wall units.\n\nThat mouse owns my house right now. It’s stripped the traps of peanut butter 5 times.\n\nMy dogs are just too slow.", "My husband once thought he was retrieving a catnip mouse wedged into the toe of a shoe for our cat. He got a nasty surprise when the little vermin bit him. As he pulled his finger out covered in blood the mouse ran out and our cat got it in an instant. She’s the most intense mouser I’ve ever seen despite being in a shelter since birth. Even my rescues who lived outdoors can’t touch her record. \n\nI can’t believe my friend once asked me to babysit her daughter’s pet hamster when they went on vacation. I rescue and foster cats and kittens. My house is full of felines. Who the hell asks a person with a house full of cats to babysit a rodent? I love all animals including pet mice, but I stopped owning rodents when I got my first cat. \n\nBut she insisted and had nobody else to ask, so I took the hamster and locked up the room it was in as if I had the Crown Jewels in there. It was the most nerve racking two weeks. \n\nGood luck, as much as I love animals I know how a mouse infestation can damage a house. They get into the walls where cats and dogs can’t get at them and do a lot of damage. So I hope you get your mouse out. And always assume there’s more.  I really recommend hiring an exterminator to help find out where the mouse entered and end the problem while it’s still manageable.", "This happened to our cats so often I decided to Go and buy a couple of black pool noodles, cut it to length and jam it under the fridge and stove, it's not 100% but it definitely reduced this by like 95%. Make sure to cut some shorter ones to fill in the gaps on the side if gap exists.", "“Perform your function slave. Retrieve my dearest wife’s plaything at once!”", "Ah, yes.  toy retrieval, the Purrfect Feline Pastime.", "I am deeply impressed by those clean floors. Right in front of the stove? In a house with two long haired cats and at least one child?! A+", "I had to do this same thing today.  My cat was sticking his arm under the stove to retrieve his lost toy so I grabbed a yardstick and swooped it out with about 8 other toys.  Then he ate a raw noodle that was under the stove because he’s a derp.", "If you haven't done this for your cat, does your cat even own you?", "I have so been there!", "Oh, I know this game.  They'll bat it right back under there.  I guarantee it.", "I love that your cat has an emotional support animal", "My husband took apart and cleaned our sectional today. He kept bring cat/dog toys to me. Also color pencils. I guess we all lose our toys to the couch.", "One of my cats used to love checking under things for stuff. It was one of his favorite activities. But he wasn't super good at it. He would march back and forth in between me and whatever I was looking under, and would duck his head down occasionally to help look. But he never grasped the idea that he was usually blocking my vision and/or flashlight.\n\nBut he got excited any time I got in the floor to look under something. He lived till he was 16, and looking under furniture for stuff never got old. Any time we were lucky enough to find a toy was just a bonus.", "Your cats let you have hand towels?", "I love the cat with his paw on the other.\n\n***Its not long now son! Playtime shall commence!***", "Orange cat: \"Calm down bro. The human's got this.\"", "Im stoned and it took me fifteen seconds to realize this was not a video or gif. LOL \"Wow those cats are really patient.\"", "My cat thinks that clothes hangers conjure springs and ping pong balls so he asks for me to use them even when there is NOTHING UNDER THE FRIDGE AND OR OVEN", "Tell me how I thought this was a video ?\n\nSat here staring at the damn picture for a solid 20 seconds at least ?", "HYSTERICAL!!!", "You know stoves pull out very easily right? Great way to clean back there too.", "This! I do this exact thing. My two try and get in front of my face while I'm looking under the fridge with my grabber stick.", "We ritually do this every day with a bamboo stick under the sofa. Delighted it's not just our fur friend here!", "It's happening, brother! Soon we will be reunited with crusty foam ball #3489b. That was a great ball! Can't wait to push it under here again!", "You do know that you can pull that drawer out and have full access to beneath the stove don’t you?", "This is what it totally looks like when my cats would inform me of a possible mouse spotting. \n\n\nMore recently it’s been a noise in the ceiling, and if posting pictures to reddit didn’t suck so much, I would share their 3am “what’s that in the ceiling” poses.", "I love the support system", "We announce this in our household as, “Getting the Getter.” The “Getter” being a giant black flyswatter.", "I love how one is comforting the other  over her loss", "That arm of support ?", "That is unbelievabley hilarious!!!", "My St. Bernard (Sherlock) always gets his toys stuck under the couch and he just cries while staring at the couch until I get it out. He also likes to stick his big fat face next to mine when I’m trying to look under the couch for it.", "What are you doing, step-cat?", "BELIEVE BUDDY!! He’s got this", "You can take that lower drawer out relatively easily. Just lift it off the track.", "My mom cleans the area behind the stove every three months. (She cans anything preservable and it gets everywhere, so the deep cleans coincide with canning) We're talking shutting off the gas, pulling the stove out, scrubbing walls and stove, etc. The amount of cat toys she finds....", "Did anyone else think this was a GIF and watched this for a while expecting to see the toy?", "\"Buddy, it's coming. Look! It's almost here!!!!\"", "Just remove the drawer it’s a lot easier", "I love how the one on the left is like \"it's going to be okay dude!\"", "Brown/Orange cat: Don't worry, buddy. You'll get it back.", "That \"support paw' awwwmg!", "After my dog passed away a couple months ago I gave her tennis ball over to the cat. Problem solved or pretty much so anyway. Actually never had considered giving a tennis ball to any of my cats. Been digging kitty toys from under all manner of furniture for years and hasn’t thought of a tennis ball before but I guess they like those too.", "Get a 2x4 and cut it so it can be right behind the front legs of the oven. Put it two screws at the top of the 2x4 and then use rubber bands or string and wrap around the oven legs and screw. Do not do this if that bottom drawer is a broiler.", "Well I'm invested now too, what's under the stove?", "Pull out the drawer to see underneath.", "You know stoves pull out.", "I would buy this painting", "Those are some gorgeous cats!", "I bet it’s half-baked.", "This is nearly r/AccidentalRenaissance material\n\n^crosspost?", "I like how the one on the left looks like he's comforting the other one like \" don't worry man she's gonna get it\"", "The calico cat is saying to his pal, \"Hey buddy, you think we'll get it back soon? You see it?\"", "great picture!", "i love how the left cat consoling the right cat like saying : \"everythings gonna be okay\"", "I like the 'There, there, dear' paw of support.", "Wow those coats look so soft & fluffy! ??", "Oh boy can I relate ?", "It same as my dog when he's playing with his ball then it goes to under the refrigerator and he looks at me like saying \" can you get it for me ??\".", "I'm so anxious\nWhat kind of toy is this?\nDoes it squeak?\nDoes it it cry?\n\nIs it colorful? \nOr full of music? \nI, wonder and hope for it's future\nFull of hope and adventure!" ],
      "Id": "luw2wp",
      "Submission Name": "Anxiously awaiting toy retrieval"
    },
    {
      "Score": 19606,
      "Comments": [ null, "It looks like a Warrior Cats book cover.", "I came here for this", " Cutie pie!<3", "Something precious this way comes.", "Reminds me of The Secret Of Kells", "BRUH OTHER PEOPLE READ THAT? XD On a real note,  I loved them as a kid so I bought my wife the whole first series as I knew she would enjoy them. She'll be ready for the 2nd series very soon.", "That’s awesome! I grew up with them, so I read the main series as school library books. I own most of the Dawn of the Clans series, but I’ve only read two of them. I really loved Omen of the Stars.", "YES", "Exactly my thought. Loved that shit in middle school.", "Clever girl...", "You peice of fuck you beat me to it", "Immediately what I thought of!!<3", "Ugh I wasted all damn day scrolling on this app and still somehow missed the opportunity to make this joke", "Khajiit has wares.", "Khajiit has crack if you have coin", "Skooma?", "[I never noticed this before.](https://i.imgur.com/VCXaImo.jpg)", "[This guy](https://s3.amazonaws.com/burnsfilm-prod/images/000/001/391/extra_large/20141015171906-secret-of-kells-cover.jpg)", "Reminds me of The Secret Of Kells", "I dont know why, but I immediately thought of Redwall!", "I had the same reaction. It’s very similar to the cover of [_Outcast of Redwall_](https://redwall.fandom.com/wiki/Outcast_of_Redwall).", "Thank you, I was wracking my brain trying to remember which one had the 6 fingered boii!", "This was instantly what I thought of as well!! Actually the only reason I came to the comments was to see if anyone else did. Funnily enough, I’m rereading the whole series right now, and Outcast of Redwall is the next one on the list.", "\"Every day I worry all day, about what's waiting in the bushes of love\"", "49 times", "It was 49 times", "Immediately what I thought of.", "Similar to the blanket shark the elusive shrub shark in the wild.", "Bee-boop! Cutie pie!", "Something precious this way comes.", "Reminds me of the Lord of the Flies cover.  Reading it as an adult, you understand it and appreciate it a lot more.", "Phenomenal photo. Gorgeous.", "[Photoshopped](https://www.reddit.com/r/aww/comments/jyqn35/i_can_see_you/?utm_medium=android_app&utm_source=share), but it is excellent, used it as my phone background for a long time.", "I was going to comment the same thing. Both the real and photoshopped wallpapers are nice tho.", "This would be a dope album cover!", "Set as home screen wallpaper? Tick.", "Secret of the Kells (but a cat)", "r/catfruit", "r/attackeyes", "This is my freaking wallpaper since times immemorial lol", "I used this guy as my background for a while x)", "Ohhh how cute! The face is so small and round that it reminds me of a rusty spotted cat. ?", "i wonder what it is...", "Doggo", "Catch me if you can ???", "God/Goddess of earth", "Nice click", "Getting Mayael the Anima magic the gathering vibes", "This should be an album cover. But Idk to what genre of music.", "Hey I posted this before lol", "This is definitely becoming a phone background for some people", "Awesome", "Leaves?", "\"They're in the trees!\"\nThe american GI didnt know that in fact, Charlie was in the bushes", "Rengar MonkaS", "This should be the live action Warrior Cats movie poster", "It’s cute cat", "This is the wallpaper on my phone.", "Cuddles? for a adorable friend", "Who wants to talk about politics and hitler for some reason I can't find", "Who else thought of Homer Simpson receding into the bushes?", "Must have been the wind...", "so cute and love it", "Rengar", "That's what she said", "Cat nip?", "I'm pretty sure it's a cat", "This can be a warriors background cover", "The bushes of love?", "Reminds me of Cheshire from Alice in Wonderland", "Bell?\n\nhttps://www.smithsonianmag.com/science-nature/moral-cost-of-cats-180960505/", "Reminds me of my boyfriends moms cat, “mr kitty”. He likes to hide too ?", "I have this picture as my phone case - got it on etsy", "BOOP", "cutest thing", "Oh my. That is such a precious face.", "Jungle Drum by Emiliana Torrini! \n\nhttp://www.youtube.com/watch?v=iZ9vkd7Rp-g&t=0m31s", "Is he in the Vietcong army", "This is one of the most adorable things I've ever seen... where's my cat?", "Cuteness will be pouncing!", "Way cuter than spicer", "This would be great for a puzzle!", "Omfg, can someone make this a wallpaper please? Phone or computer.", "This would be my black cat. She loves to hide and blend in with stuff , when you go to walk by she jumps out at you and scares the hell out of you", "Cute and mysterious!", "They still are **predators** ...\n\n..., Fluffy cute predators, but still predators ...", "Lookin like an Iron and Wine cover.", "I have this as my wall paper", "?In the jungle the mighty jungle the lion sleeps tonight?", "How do I create this color of green in post while editing photos?", "Aww he stalk like smol boi", "Hey, this is my lock screen!", "Reminds me of Obama’s official portrait.", "This is a great picture thank you", "Hello new cell wallpaper", "Good phone background lol", "Everyday I worry all day..", "Why do these leaves look like that one photoshop texture", "They’re in the trees!", "This would make a wonderful wallpaper for your phone.", "Peek a boo I see you!", "It’s a yeti", "Funny name for a cat lololol buddum tish, haha boink", "This is art.", "This has to be the cutest photo of a cat I’ve ever seen!", "That's a beautiful picture. If you took it, OP, you should enter it in every photo contest you can find.", "It's photoshopped. But still amazing.", "Yes its cute, but isnt anybody going to appreciate how beutiful of a picture this is?", "offtopic but what is the camera and editor used ?", "Remind me of that Obama painting" ],
      "Id": "luuetw",
      "Submission Name": "Something is in the bushes"
    },
    {
      "Score": 6431,
      "Comments": [ null, "HELP IM DROWNING!!!!", "#IN CUTNESS", "Cute mode ENGAGE", "Lol, that's exactly how it is!", "I am a jellyfish!!!!!!!!", "Have you seen my penguin ?", "Help. Can’t stop watching video. Been 3 weeks. Running low on snacks. Can’t stop watching.", "I don't blame you.  Send your address, I'll send you snacks... Hahaha!  ???", "Wiggle wiggle wiggle", "Oh my god ??? this is beyond cute", "Im fucking TAKING THIS! THERE IS NOTHING YOU CAN DO! I WANT HIM.", "Omg", "I wish I could do this to loona", "She’ll probably bite your hand off lmao", "u/savevideo", "[https://i.imgur.com/3nuSaXH.gifv](https://i.imgur.com/3nuSaXH.gifv)\n\nhere u go", "Should post on r/peoplefuckingdying", "u/savevideo", "*windows startup sounds*", "u/savevideo", "r/BetterEveryLoop", "Lol too cute.\nI can practically hear the wind up noises just watching the arms flail about.", "AaAaAaAaA this is SO CUTEE", "Best quality: his wiggles", "So cute", "u/savevideo" ],
      "Id": "luxttl",
      "Submission Name": "Boop the snoot to activate the cute"
    },
    {
      "Score": 17878,
      "Comments": [ null, "Awww, how cute! I love it when my cats hide under a blanket, and makes that purr / light meow sound when I check on them, kind of a \"hi mom, how did you find me?\"", "They're pretty awesome. He's obsessed with going under blankets lol", "It's their secret den you *definitely* don't know about", "It looks like Pink Panther.", "That would make him a Blancat.", "I started to hum the *Jaws* intro song!  Please give your sweet kitty a snuggle from me, okay?!  ???", "Their activation sound! r/activationsound", "Exactly! How adorable that it has its own subreddit", "I know right! It’s one of my favorite subs", "my heart is melting!! ( ?? ? ???)\nyour cat is so so cute and the way you captured this photo almost makes him look like he’s in glittery, purple space! ?\n\nwhats his name?", "His name is Nugget, on account of the fact that he was the tiniest kitten I've ever seen, so we started calling him lil' Nug. He goes by many other names as well, such as \"His Royal Highness\" and \"Your Majesty\" haha", "aaawhh!! thats super cute! well thank you for sharing lil nug, my day brightened up because of him ?", "He's still young, you could change his name to \"nuggie\", it's not too late!", "You forgot \"His Royal Worshipfulness\"!", "I like your photo and I like your cat", "Pretty sure that's a shark", "Why thank you", "My grandmother's cat Roscoe used to do this. He'd stay in the bed as she made it so there'd be a Roscoe-shaped lump in the sheets.", "Watch out! Here comes the blanket shark! It may bite you on the toes", "Just a little nibble to see if you're a seal!", "My little guy just loves when we change the sheets, he's under it before you even know he was in the room.", "He's so obsessed with being under the blankets he'll wake you up in the middle of the night by pawing at the blankets by your neck until you lift them up for him to crawl under lol", "My new kitten does this. It’s annoying and adorable. My other cat (coincidentally nicknamed nugget) loves to “help” make the bed and gets annoyed when I won’t tuck her under the fitted sheet ?", "We call this the \"sheet beast\" where I'm from!!!! Hahaha", "Blan-ket shark doo doo doodoo doodoo", "It looks like Pink Panther", "No, looks like a shark!", "Amazing!!", "???", "DUnnn DdUUUN DUUnn DdDdUUUUUnnnn DA DA DAAAAA DODODODODODOOOO!", "Awe he looks just like my cat! She's a little monster who doesn't know what personal space is lol", "Very cute", "eyes WIDE", "Great pic!!", "OMG THOSE EYES", "That looks says, “umm... you’re not supposed to be here. This is my special place.”", "Incredible photograph!", "pls give him pets from me ?", "Blanket Shark...very cool ?", "This cat appears to be questioning life at this exact moment.", "I don't think he ever expected to be found, even though there was a very obvious purring lump on the bed when I walked in haha", "I'm occasionally sad that I missed out on kitten years... But my Lucy still entertains me. We rescued her about 4 years ago and she was already an adult.\n\nShe wants nothing to do with the 2 dogs... But they have a detente at the moment.", "This cat is on mushrooms. Change my mind", "The looks in that sharks eyes...", "Dutch oven the little cutie", "He looks like he is surfing the galaxy....", "Dolby is a free elf", "I myself have a bedbear (dog) and he does this same thing to any blanket anywhere.", "I love discovery channel, I learn so much about these elusive species", "Awww!", "Awesome pic.", "Absolutely Terrifying.", "r/ProperAnimalNames", "I heard they may trick you with their cuteness. Be careful! Or don’t.", "Dude looks stressed", "Watch your toes!!", "Oh my God this is adorableeeeeeeee. I wish I could have pets.. most of my family is alergic though :<", "I can't be the only one who read this in an Australian accent.", "Blanket shark! I love that!", "What camera did you use?", "Insert Jaws theme song and its perfect.", "We call this the \"sheet beast\" where I'm from!!!! Hahaha", "I love the colour of your sheets!", "They shred their meat I am told.", "The left ear is giving me the huge ooofffs. Devin feline.", "Literally a White Pointer!!!", "Getting in their second wonderful world ?", "Aww, this kitty looks so anxious, I want to scoop it up and cuddle it immediately <3", "Poor thing?", "I take an issue with description \"in the wild\"." ],
      "Id": "lurvuz",
      "Submission Name": "Caught a picture of the elusive Blanket Shark in the wild"
    },
    {
      "Score": 5698,
      "Comments": [ null, "I'm a little sweet (killer) kitten and now pat me human", "I think she’s gonna nom that human….......", "Good thing the human is safelyDead", "The snoot boops, they call to me.", "DO NOT BOOP", "bruh i gotta", "IT AIN'T WORTH", "but", "BOOP DAT SNOOOOT. NO MADDEW WHAT. BOOP. DAT. SNOOT.", "r/forbiddenboops", "I would like to pet this creature. It would be but a simple boop on its little noggin!", "Look at those eyelashes... so pretty. Very disney-esque", "I was just thinking of Nala's bedroom eyes.", "See the *slow blink*?  All cats do this & it means they trust you enough to close their eyes around you.  They know you won't hurt them!  ???", "big pawbs... i would let her eat me alive", "Georgie when he was a cub! He's a big boy now: [https://www.youtube.com/watch?v=a6ozw3kHCDc](https://www.youtube.com/watch?v=a6ozw3kHCDc).", "I knew right away it was either Georgie or yame such sweet handsome boys that have made incredible improvement!!", "Like a Disney princess", "Is this where Disney got the Nala eyes from??", "This reminds me of Nala's do-me eyes", "I was thinking more about the  size of those paws.", "Now pet that big cat!!", "I think she’s gonna nom that human….", "Wow! That's a lion! Adorable!", "What a pretty kitty... I’m officially jealous", "Big-o catto. Must love. Ca(~~n~~)'t resist.", "The eyes Chico , they never lie", "/r/BigCatGifs", "Them pawwwwwwssssss", "Yes lashes!!!", "Ooh, big kitty! :D", "There's no audio to this but I'm 100% certain it purrs so loudly", "Hey they did the slow blink!", "God I love cats", "Biggo Catto", "Aww my snack is so fuzzy today!", "wow that is a lion", "u/SaveVideo", "So pretty", "That smile at the end tho.", "Idc if it kills me but i wanna raise a lion cub.", "be a lot cuter if it was a jaguar cub but ok" ],
      "Id": "luw2v2",
      "Submission Name": "Them eyes..."
    },
    {
      "Score": 60978,
      "Comments": [ null, "Damn I need to get a girlfriend. And a Dog. And a bed.", "and a camera", "All I need is *CrAcK*!", "And putas.", "Y cocaina", "Cocainum", "I'm a Firefox man, myself.", "[PUTAS HARRY, PUTAS](https://youtu.be/297Ra0sZ_FI)", "r/cursedcomments", "we can get crack from roxy!", "And a vessel for my soul to reside", "and a face", "And my axe!", "And my sword!", "And my bow!", "And me brown pants!", "You carry the fate of us all, little one. If this is indeed the will of the Council, then Gondor will see it done.", "You need people of intelligence on this sort of quest, mission, thing!", "And my axe!", "And money.", "And someone to hold the camera", "Hes also quite handsome. As a heterosexual man I'd like to say... he's very nice looking. Like.. if I woke up in the morning and looked like that? I wouldn't be mad.", "If I woke up looking like the dog I wouldn’t be mad.", "If I didn’t wake up I wouldn’t be mad.", "\"Ja ja ja... It's funny because its true.\"\n\n*sad face*", "Happy cake day!", "As a fellow heterosexual man, I don't know why we have to be so defensive to acknowledge that a guy is handsome. I don't know why you had to even mention that you were a straight guy in your comment. We should openly acknowledge and comment that a certain man is attractive without it meaning that we're attracted to them. I've never been interested in guys and sure as hell have never been aroused by them but I personally feel OK saying that some man (at least, for sure someone I don't  even know irl) is handsome.  \n\n\nThe guy in the video is like obviously conventionally handsome. I don't think there's any point in trying to twist around it if you agree.", "Dude there's no problem with calling another dude handsome calmate.", "That's exactly what I said.", "That's his step sister.", "And her boyfriend was holding the camera", "He is the one holding GME stocks, right?", "The one responsible for multiple puprisings", "Still not the weirdest porn I’ve ever seen", "And his step dog", "And look like the winter soldier", "This made me lol", "“And a bed”\n\nYou poor thing", "I got a floor.  My closest friend..", "If this were a movie, this would be the video that the main character plays over and over after their spouse dies.", "True, and i wouldn't blame him", "I would blame the one who killed his dog though", "And there’s my quarterly excuse to watch the John Wick Trilogy", "Check yes", "Juliet", "Unless it is —spoiler alert—-  someone with a name starting with “Ag” and ends in “ha” :)", "*The ATF, FBI, and local PD dislike this*", "I said I was sorry.", "Dead girlfriend in the video: are you filming me? Stop, I just woke up. I look terrible. \n\n\n\nBf: you are always beautiful", "https://youtu.be/yZh6tnAXiHE", "I immediately thought of Annie lol", "Please don’t ‘Jim’ the camera", "Another one https://youtu.be/sAkVS0ENRLw", "Or after their dog dies :(", "Or after he dies. :'(", "That the dog watches after the owners die", "The end credits after we all die", "Freak accident that kills both.", "If by accident you mean Russian gangster's spoiled son.", "John Wick!", "this couple was actually in a freak accident over summer. hit and run. the girl couldn’t walk for so long. (kristin and marcus on youtube)", "Porque no los dos?", "This hits harder for sure.", "If the dog died he'd be on a killing spree", "but because this is real life, the dog just used his tongue to wash his balls before this", "Dude we were all having fun here", "Lol that is so sad", "well that deescalated quickly!", "John wick four multiverse of madness", "Nice observation. It's so accurate.", "[Almost](https://www.youtube.com/watch?v=Rs02UZF5mjU)", "That’s a whole lotta dopamine.", "You mean Oxytoncin. Love's Dope.", "No no, it's spelled \"oxycodone\".", "Ah yes. Dope's Dope.", "Brand name is OxyContin.", "Billy Mays here!! It's spelled OxyClean.", "You mean oxytocin. And this would still be a dopamine release.", "It would be dopamine, serotonin and oxytocin all at once", "Dogxytocin*", "And cooties ?", "“Today I found my best friend in bed with my girlfriend”", ">*“Today I found my best friend in bed with my girlfriend”*'\n\n---\n\nToday i found my Best friend - he was lying on the bed...\n\nbut someone else was With him! she was loving on his head!!\n\nfirst i was kinda jealous (I'm his Favrit in the worl...)\n\nimagine my relief\n\nwhen i found  out \n\nit was my Girl... ^;@)\n\nsee, i'm a lucky puppy with Two humans of my own\n\n(it seems there's always two of us, so no one is alone)\n\nbut when we three together, it's just something that we do\n\nmy guy n girl are kissing, so\n\nI'm gonna kiss them, too\n\n??", "Thank you Schnoodle - I love your poems, fresh or old, they're always so warm, it never gets cold. With Schnoodle around the love fills your heart, he moulds our feelings for dogs into art!", "this a fresh schnoodle and AWWWW that made my heart go warm", "What guys really want.", "What humans really want ??", "What dogs really want ?", "Guys only want one thing and it’s fucking adorable", "Guys only want one thing and it’s adorable fucking", "You know he's grinning more when he remembers Aunt Cass.", "I'm not in this picture and I hate it", "Also, this is a video.", "Moving picture, even.", "I don’t know why I laughed so hard at this", "maybe it's enough for him to be in one single frame", "Not in any of these hundreds of pictures?", "I have neither", "It's ok bro, I would kiss you.", "It's ok bro.  My dog would kiss anyone...", "So would my girlfriend apparently", "Can confirm, I’m his girlfriend", "I like you :)", "Now kith.", "voltaire", "Oof", "I’ll take a kiss", "Kissahomie", "Is that in Mississippi?", "Ashley riot? Is that by chance a reference to Vagrant Story? And btw *internet hugs for you*", "Well, at least I have a cat.  Although, he's doesn't give me kisses. As a matter of fact, he's sitting on the other side of the room...judging me.  And by the look on his face, he's disgusted by every choice I've made in life.  I wish I didn't have a cat.", "**\\*Disclaimer at bottom**\n\nCats don't always express affection in ways we can recognize. A lot of people don't realize this, but cats are very emotionally needy and dependent upon us for affection. To you, it might look like your cat is keeping an eye on his human vending machine and judging you from afar, but what he's trying to say is that your presence brings him enough comfort/joy to warrant staying in the same room as you. He's trying to give you space but is also enjoying watching his favorite person! If he turns his back to you, that means he trusts you enough to be in a vulnerable position. As for the face, that's just cats for you :)\n\nAs for that thing cats do where it seems like they lure you in with a request for belly rubs, only to bite and scratch, this isn't actually the case. When a cat shows you their belly, it's the same principle as when they turn their back to you - a display of trust - but more. So it's surprising to them when we violate this trust on some level and invade their personal space, and their natural response to something in such a vulnerable spot is to bite and claw.\n\nCats also don't enjoy being firmly petted like dogs do; petting cats the length of their bodies with your palm can build up very unpleasant tension in their bodies and make them feel like they need to lash out as a release.\n\n\\---------\n\n\\*I really can't remember where I read this - it's either from one of the books on animals I've read this year or from a random internet post, but I did a quick google and am almost certain that what I'm saying here should hold up. I could have left some things out or gotten details wrong, so if it matters to you, make sure you stay cynical and fact-check everything here <3", "Almost everything you said is right, but needs an asterisk by it with the note of \"varies by cat because they all have unique personalities.\"\n\nSome cats love belly rubs. Some cats like to be patted roughly. Some cats make it their mission to be right next to or on top of you at every waking (and sleeping, because cat) moment.", "Belly rubs with my hand is fine, but if I dare touch his stomach with my filthy foot he will remove it from me posthaste.", "Same", "r/absolutelynotmeirl", "I'm not masochistic enough to go into that sub.", "maybe r/sadism is a better fit for you", "Aww, I appreciate the helping hand!", "thats as good as it gets...", "Don't look at me, I didn't name you.", "If there's a heaven, this guy has found it.", "This is all I want lol", "I'll try to have a life like this", "Let’s get there friend :)", "Aww, being loved, that sounds nice", "That ever expanding smile was amazing. Super adorable", "I concur, muffin.", "Indeed, indeed, Muffin", "\"Ted, we found you in the park, throwing rocks at old couples\"\n\n\\- \"Why should they be happy?\"", "Soo... happy", "Aw, my wife and I had a corgi that would do this. \n\nSo cute!", "My corgi loves waking up my husband by licking him on the face. It's so flipping adorable.", "Five minutes ago, that dog was licking it's anus.", "And she may have been licking his... who knows.", "touche", "correct", "I was smiling as I scrolled down the comments...was", "This is the most wholesome thing I've seen in a while. What a lucky man.", "kristin and. marcus on youtube. they’re amazing", "I wanna be this happy", "We need a type of Tinder for redditors...", "I second this", "I've said this so many times, an app that matches redditors based to sub reddits they goes to", "I should stop hanging out on r/truecrime then...", "I mean ... my plan is still betta, I realise it has some holes now", "I’m so alone", "Anyone know who the guy as the filling in the sandwich is? \n\nAbsolute spitting image of my friend", "Those are Kristin and Marcus Johns", "This is so cute", "Well not I’m smiling uncontrollably, thanks", "Bliss...", "My dog after eating it’s own shit. ?", "This is technically a threesome.", "So is sex with a pregnant woman but we don't say this shit out loud.", "I did not consent to reading that", "I think yours came out even weirder.", "Came. Lol.", "How do I go back to 30 seconds ago?", "Reminded me of the girl who thought kissing in bed was having sex so she ran screaming to her dad saying she had sex with the dog when it licked her in bed.", "Yeeeap lmao\n\nThe dad must have been ..\n\n#YOU DID FUCKING WOT MATE ?", "Someday I wanna be this guy", "What happens next will shock you!", " ?????????????????????????????? ?????????????????????????????? ?????????????????????????????? ?????????????????????????????? ?????????????????????????????? ?????????????????????????????? ?????????????????????????????? ?????????????????????????????? ?????????????????????????????? ?????????????????????????????? ?????????????????????????????? ?????????????????????????????? ??????????????????????????????", "This is Marcus & Kristin from YouTube! They have lots of adorable videos with their two goldens, highly recommend!!", "When I said I wanted a threesome. This is what I meant", "This is, like, the last thing I ever want to see", "Seething incels incoming", "already are some sort by controversial", "Man, I am jealous... doesn't happen often.  Damn.", "Is the cat filming?", "I'm weirdly jealous and happy at the same time.", "These two were nearly killed in a crash while they were cycling. CRAZY", "Damn she’s cute, the one on the right is ok too", "One of them was licking butthole shortly before the video was made.", "Him: yeah I've had a threesome before.", "That bitch ain’t giving up......", "My life literally sucks lmaooo", "Guys only want one thing and it’s this", "Oh man, I am so jealous of and happy for that guy.", "I have never felt so lonely.", "Ah yes here comes the pain", "lol imagine being loved\n\nimagine being deserving of love\n\nimagine being happy", "I've never been more jealous in my entire life", "Well, I'll never be this happy.", "Self fulfilling prophecy my dude.", "That's my 'American Dream' bro no cap", "SNAP BACK TO REALITY", "Ope there goes gravity", "Ope, there goes rabbit, he choked, he's so mad", "But he won't give up that easy no", "He won’t have it.", "I think the dog is winning", "Kisses on one side windshield clean on the other.", "\"Tell me about your first threesome.\"\n\"One of the girls was hot but the other one was a real dog.\"", "This better not awaken anything in me", "His girlfriend’s got competition", "This looks very nice", "/r/mademesmile", "This is Marcus and Kristin Johns, they’re Youtubers and also have two gorgeous golden retrievers!" ],
      "Id": "lupt06",
      "Submission Name": "Living his best life"
    },
    {
      "Score": 2430,
      "Comments": [ null, "s m o l", "S m o (w) l", "Baby shammy", "He's a bit confused but he's got the spirit", "Day 7: I have infiltrated their ranks. No one suspects anything.", "This was such a great surprise.   Thank you, it put a smile on my face.", "Me too! What a ?", "I is chikin cluck cluck hoot--oops, I mean, cluck...", "Look at all those Chickens", "That little girl grew up to be Tricia Takanawa from Quahog 5 News", "Am just ^smol chick'n", "I said awww at just the hens ;-;", "they are very pretty indeed!", "Is it superbowl sunday already?", "\"We have been invited to a superb owl party.\"", "LOOK AT ALL THOSE CHICKENSTH", "Whoo you looking at?", "\"Bock bock bock bock bock\"\n\n*\"whooo?\"*", "What a hoot.", "there is an impostor among us", "Please post to r/superbowl.", "Done! Thank you, what a great subreddit!", "Hoo I mean bagawk", "RED CHICKEN IS SUS!", "Fun fact: these little guys sound like a tiny truck backing up. They sound about as cute as they look.", "I was going absolutely mad the first time I heard that sound. Is it... an alarm? A piece of machinery? \n\nBut now I welcome that sound so much, it means spring is on its way!", "How beautiful & cute???", "Brown-white is sus", "Pigwidgeon got a little lost delivering the mail.", "Frankly I don’t give a hoot.", "^(who...)", "It seems there is an imposter, but *who...*", "r/actlikeyoubelong", "[\"I'm gonna get me a chicken today...\"](https://youtu.be/LBJ1ZlTPd5I#t=33s)", "R34 would like to have a word with you sir. You're supposed to start uploading if you don't find what you're looking for." ],
      "Id": "luz85y",
      "Submission Name": "Nobody here but us chickens..."
    },
    {
      "Score": 5333,
      "Comments": [ null, "Ceiling cat is an OG", "This looks as though Basement Cat has taken over Ceiling Cat's domain!", "Even CC needs a vacation now and then", "is watching u masterbate", "Original Gato?", "Specialization in cat burglary", "Ceiling Cat!\n\n[It's an old meme.](https://knowyourmeme.com/memes/ceiling-cat)", "Its an older meme but it checks out.", "It's an older meme but it checks out is an older meme, but it checks out as well.", "Millhouse is a meme.", "It looks as though Basement Cat has taken over up there, though.   \n[https://unanything.fandom.com/wiki/Basement\\_Cat?file=Basement\\_Cat.jpg](https://unanything.fandom.com/wiki/Basement_Cat?file=Basement_Cat.jpg)", "Ceiling cat is watching you shop", "As long as he's not watching me do that other stuff!", "The brand new CatCam! This state of the art surveillance camera will make sure your house or store will never be broken into. It even includes a defends system as well! Price is 199.99 till stocks last. Buy now an don’t miss out!", "If you need help you can pspssppspspps me.", "Looks like a dispensary too, hahaha stoner cat security team", "The successor of an ancient meme. The return, the son or daughter, or perhaps simple reincarnation, of ceiling cat.", "Sprinkles!", "You have been blessed by Ceiling Cat now go forth and do his works and then you can has cheezburgers.", "Best camera surveillance i have seen in a long time", "Unfortunately it has to recharge about 15 hours a day.", "Just a small downside", "Ceiling Cat watches all.", "purrveillance camera", "*catmera", "Cat: Hey! I see you pocketing that! However, the shopkeep fed me five minutes late, so I am feeling a little spiteful today. I will forget I saw it.", "u/savevideo", "This looks old, but holy crap is this dangerous", "Ok I'm fine with being survielled", "The second coming.", "Catmera", "put that cat on the payroll", "It’s a living...", "Do those unicorn carts sell well for you guys? We had to practically give ours away.", "Catscan", "Hello. Welcome to my home. If you need anything, I'll be right here.", "you mean mew installed", "Big “Kitty” is always watching...?", "Did somebody say \"PSPSPSPSPS\"?!", "Waiting for the cat to yell \"buy it or get out\"!", "It's a catmara", "Dammit Mrs. Norris is going to get Flich! We might get in trouble......or worse expelled!", "Ceiling Cat 2.0", "That's actually kind of terrifying.", "*Hurry up and buy!*", "Khajit has wares if you have coin", "Cat in your ceiling huh?? Look, now your talking my language.", "BlackCat systems...\n\nCutting edge right now...", "The Dark Knight!", "Ceiling cats are one of my favorite types of cats\n\nI mean basically all types of cats are my favorite, but still", "u/SaveVideo", "u/savevideo", "u/SaveVideo", "u/savevideo" ],
      "Id": "luuqow",
      "Submission Name": "New installed surveillance camera in the store"
    },
    {
      "Score": 1105,
      "Comments": [ null, "That face makes a yin yang!", "Exactly what I thought when I first scrolled and saw the head.", "Cursed_feet", "As a penguin fan thank you.", "Just doing my civic duty", "Yin-yang penguin", "scared me with the claw", "Finally, someone said it!", "I fekin love penguins, and I almost never see them here.", "“It’s so fluffy!!!”", "Amazing feet.", "I find your lack of ~~penguins~~ faith ~~disappointing~~ disturbing\n\n~ Star Wars rough draft", "Lol, that's what I was quoting", "Penguins are some of my favorite animals", "This is my youngest sons most recent pose when he's being funny", "You'll only find them on a sub if you're in the Antarctic", "Thats cheating <3", ":>", "Aahw" ],
      "Id": "lv2kj9",
      "Submission Name": "I find the lack of penguins on this sub disappointing. So have one on me."
    },
    {
      "Score": 4578,
      "Comments": [ null, "I love seeing big burly dudes fawn over tiny lil creatures.", "With his Deadpool shirt. Classic!", "Big & burly, bald headed, full arm sleeve tats, ZZ top beard, full on biker look. Then throw in the Deadpool shirt and the child like enthusiasm getting a puppy. Sooooooo Cool", "The gasps and the look on his face when he does it make me so happy. I'm glad they caught him already lying down because he goes head over heels for that puppy.", "He went from grown ass man to a lil boy in 2 seconds. Cutest reaction ever. Yes he would have toppled over if he was standing.", "Bigger they are, the harder they fall.", "This looks like an older me! I'm glad I have something to look forward to. Also I get a puppy! Lol.", "He looks like the older version of my kid's dad too. But he always talked about getting a great dane though. Lol.", "He’s so gentle with the puppy. He looks like he’ll\nBe a good dog dad.", "I want to watch them get friends for the next hours or so!", "He’s even gentle with the inflatable dog", "That was lovely - tough-looking dude turned to mush over his new little dog. SO CUTE!", "Congratulations Pops, you’ve been adopted!", "Can we please talk about the balloon dog he had on the bed in the beginning of the video?? I mean, the entire video is so pricelessly adorable but the fact that he had the balloon dog, then gently putting in away to see the Frenchie speaks so much about this wonder person", "And it was also a balloon Frenchie. He has a thing for this breed and they got him a real one!", "My dumass thought it was a blow up cow.", "So sweet. He looks so happy and the puppy licks his nose when he leans in. They are going to be best buds.", "[Source](https://vm.tiktok.com/ZMejpMNKM/)", "Makes me want to cry with joy for him", "Wish I could ever make my dad this happy. Or at least get him to the point where he doesnt sigh everytime he sees me.", "That’s the sweetest reaction from such a manly looking man! Soooo cute!!", "The pure joy on his face is awesome", "Fun fact: French Bulldogs can’t reproduce naturally, so they have to reproduce through artificial Insemination.  Most births frequently occur through c-section.", "This goes for the generic bulldog breed as well, unfortunately. Inbreeding sucks!", "For the looks!", "To me I think it’s more of a sad fact", "That’s the point. We shouldn’t be breeding dogs purely for looks.", "i was just talking about this the other day. it makes me so angry that they can barely breathe and people still breed them because they make more money and are cute.", "Wow thank you", "Designer bag for Mon. Designer dog for Pop.", "Noe fookin waiy", "PALS are gonna be inseparable.", "So wholesome ?", "I love this man!", "So wonderful. Made me smile big!!", "Cutest video ever ?", "i think someones cutting onions yeah onions", "Ya know when you see a person and think you know what they're going to sound like...", "First time I watched had no sound. Then I turned it on. Did not expect that accent to begin with", "Am a 7 foot tall bearded giant man. Can confirm. Puppies turn me into a giddy child.", "What a sweet guy", "My eyes aren’t leaking a wet substance. YOURS are. \n\n“Good as gold.”", "Congrats! His reaction is adorable. Suhc a tough looking dude is so gentle with the pupper", "The reaction is priceless.. So gentle with the puppy :-)", "He’s going to be a great ‘Dog Dad’.", "I can smell the puppy breath ??", "Oh the double breathes in his does. That’s one happy whole family - they are all lucky - lucky dad lucky doggo. As it should be x", "I love everyone in this video", "So much for everything in this vid", "So wholesome and sweet this made me cry! Omg.", "u/savevideo", "That’s so precious!", "Dad: I don't want a dog.\n\nDad after getting a dog...", "Love how delighted he is!", "This is the most heartwarming content I’ve watched on Reddit so far.", "Awwww his reaction was so sweet!", "Wholesome ??", "I'm not crying, you're crying!", "No, you are crying!", "Well then, I suppose you're right.  But dammed if I'm not happy to do so. Seeing dudes like this give in to a puppy so shortly after I said goodbye to my old boy gave me all the feels.", "Same mate. Feels good. \nI'm sorry to hear that! All the love, my unknown friend.", "That is not what I thought he'd sound like", "Awwwwww this video melted my heart. You made them both so very happy. Have fun being a dog daddy. Xxxxxx", "The relationship with his wife is super cute too", "I love this .....", "So heartwarming!!\nI love his reaction.", "So wholesome. I love the way he kept saying 'is this real' as though he couldn't quite believe it. Super cute.", "I really hope they adopted, I really can’t stand to see the continued breeding of flat-nosed breeds like pugs and bulldog, extremely predisposed to breathing problems and other health issues", "Wholesome af!!! Not long woke up and saw this. Thanks OP!", "What is it?  Boston terrier?", "Looks like a French Bulldog", "Are we going to talk about that kiss on the mouth? With presumably his daughter?", "That's his wife...", "No one wants to talk about the ghost just chilling in bed with him? OK. Cute pup tho.", "There's no such thing as a free puppy.", "I guess we know where one of Lady Gaga’s dogs went." ],
      "Id": "luuqeb",
      "Submission Name": "Her dad getting a dog"
    },
    {
      "Score": 2632,
      "Comments": [ null, "We must gather more potatoes for the Motherland", "r/babushkadogs", "One of life’s simple joys is putting something like this on an animal’s head and declaring him or her “Babushka” Never gets old.", "Those ? tho....", "She’s the master of side eyes as a normal pup and esp when the bandana is on her ?", "She’s a beauty!", "PO-TA-TOES! Boil em, mash em, stick em in a stew!", "what is potato?", "Aww my grandma used the term babushka often! Thanks for the heartwarmer ?", "I cracked up! Thank you. ?", "Babushka dog sells her potatoes in a roadside stand to support her grandchildren since she lost her husband and son in the war. \n\nShe is proud that she earned enough to buy all new school clothes for the grandchildren this year, but worries because the cold is coming quickly and the fields will freeze soon.", "Nah, she has too many teeth!", "My leetle Roshun lehdee. Pleeez. Geef me yure beets.", "Snoop dogg", "plz. neef to makuh vodka.", "I must go back and collect wheat for the Motherland.", "Commie dog commie dog, dog wit da starvation", "This is a dog that will make you melt with the depths of her big brown eyes before seizing the means of production for the liberation of all dog kind.", "Make papa stalin proud" ],
      "Id": "luw93d",
      "Submission Name": "Babushka dog works hard for her potatoes"
    },
    {
      "Score": 21320,
      "Comments": [ null, "He's too adorable", "Get that dog some food and some pets", "Feed the damn dog already!!!!<3", "The giggle after every perk is adorable", "I know right? It's like I've got a kink for male giggles or smth", "#YES, SHE'S HUNGRY! KIBBLE NAO!", "|big|\nEdit I hate my life", "Such a cutie.  Talk about \"snapping to attention\"!", "Ha-ha! \n\nOur cats do similar if you mention \"chicken, rice and peas\". Its like the \"rice and peas\" on the end makes it legit that there's going to be chicken !", "Omg the ears ???", "He looks just like my dog Vader! https://i.imgur.com/g1LJTHD.jpg", "So sweet! What kind of dogs are these?", "Schipperke I think, the one in the video anyway. My grandma had one named Chester.", "Thank you! They're so cute but I never knew what they were.", "Belgian sheep dog I think.  Schips have docked tails and are a bit smaller.\n\nSchips are bred down from Belgian sheep dogs.", "I've had three Schipperke's that didn't have docked tails. It's definitely a trend now to not dock them. I think OP's is a Schip mix, the face is very similar to my schip's", "Now that you say that, I remember her dog did have a docked tail,  unlike this one.", "I’m 99% sure mines a Pomeranian, could be a German spitz though. They look exactly alike", "He's super cute either way!", "Agreed, thank you!", "Yours looks a bit like a papillon to me, depending how big he is.", "I have a dog that’s identical and he’s a chihuahua pomeranian mix", "Our dog [Olive](http://imgur.com/gallery/f4zeq5R) looks very similar too, she's a pomeranian/cocker spaniel mix.", "Omg she's so precious! I love these little fluffy black dogs!", "Looks a lot like my pomeranian/schipperke mix", "Ha ha ha.  My daughter’s dog is also named Vader.  He’s Vader.the.pom on Instagram but he looks nothing like you might expect.", "That’s a cute dog!", "He was very dark when she got him. Lol. He lives up to the name.", "I have a similar one named Chester!\n\n[https://imgur.com/a/EJcvRjq](https://imgur.com/a/EJcvRjq)", "Cute!", "So handsome!", "Oh man, your baby and the dog in the original post are the spitting image of my dog who passed away around this time last year. Definitely thought I was finished grieving until I saw these two photos.", "Those ears are the cutest thing ?", "Is his name Smudgy?! Omg that’s the CUTEST. \n\nDon’t tell me if I got it wrong; I need to believe.", "I thought it was Smooshy, which I also love.", "I was thinking the same. God I hope its smudgy!", "\"Yes, after 20 minutes of this, I'm *still* hungry. Why are you like this?\"", "What a beautiful doggo!", "Feed the damn dog already!", "There's a secret button, I know it ... ?", "It’s done with a remote...", "Feed the damn dog, you terror ?\n\nThose eyes, those ears, oh my goodness. The floof.", "/r/feedthedamndog", "blah-blah-blah-***HUNGRY***-blah-blah-**doyawant**-blah-blah***HUNGRY***", "u/savevideo", "Don't tease the pooch!  Time for a nice long walk. ?", "But it's hungry", "Something tells me he’s hungry.", "Amazing, i love it", "r/petthedamndog", "Deploy headflaps.", "any source?", "[https://www.reddit.com/r/WhatsWrongWithYourDog/comments/luhoz0/you\\_mean\\_treats/?utm\\_source=share&utm\\_medium=web2x&context=3](https://www.reddit.com/r/WhatsWrongWithYourDog/comments/luhoz0/you_mean_treats/?utm_source=share&utm_medium=web2x&context=3)", "What breed is that? They look really cute!", "That dog is cute. ?", "That's so darn adorable!!", "is that a schipperke?", "Belgian sheep dog I think.  Schips are bred down from them and usually have docked tails.", "Could be, but it looks even more like a Swedish Lapphund.", "Beautiful baby and those ears oooh! ?\nAlso sir, you have a nice voice and a sweet laugh. If you had a podcast where you read bedtime stories, I would listen.", "u/savevideo", "u/savevideo", "your giggle is hot ngl", "So cute ?", "Wow, he looks just like the grown up version of my doggo", "u/savevideobot", "I have feeling that this dog might be hungry", "I could eat", "Sounds like 5up lol", "Smudgy very hungery.", "Good, well trained and patient dog, it would have to be to put up with this joker.", "cute", "Hahahah", "I do this to my dog all the time", "u/save_video", "SOMEONE FEED THE DAMN DOG", "Reminds me of Frank from Rescuers Down Under", "Pavlov 2.0", "Thats doggo morse code", "Oh. My. God.", "A living dust bunny", "ok, where's the string?", "u/savevideo", "Snack radar on full power !!!", "Give that good boy his damn food already.", "Omg such a cute floof.", "This looks EXACTLY like my old pupper that we had to put down last year. I miss her so much. This made my heart sing, thank you!", "Quit teasing the dog and feed it.", "/u/savevideo", "THIS IS MY DOG’S TWIN", "u/savevideo", "I had to find out what kind of dog she was (I want one!). She's a [Schipperke](https://www.akc.org/dog-breeds/schipperke/)!", "This dog looks EXACTLY like my dog! Mines a chihuahua pomeranian mix", "r/OnOff", "u/vredditshare", "Crap, now I’m hungry.", "My dog does this after I say \"Do you have to go poop?\"", "my food trigger word is \"Wendy's\"", "Lmao!!!", "So cute!", "u/savevideo", "I can't say the H word (hungry) around my dog, especially around dinner time or she'll stop whatever she's doing, perk up and come nose at my face until I feed her.", "Yes I am", "u/savevideo", "Looks like the black version of my dog [Daisy!](https://i.imgur.com/tYfnWnx.jpeg)", "EARS", "So cute", "He looks just like my dog —same mannerisms, face, build, fluffiness —except mine is multi-colored. I must have watched this 10 times! Adorable!", "Sooo sweet!", "where are his ea- oh", "u/SaveVideo", "r/Petthedamndog", "What kind of dog is this? Looks like my fav dog I lost a couple years ago.", "I wasn’t expecting EARS", "u/savevideo", "u/savevideo", "My wife's old dog used to do when she heard Gingko Biloba.", "Just feed him....Please!!! Then let me see his expression!", "Butthead has a dog", "He's too smart and adorable!!! ???", "Hilarious!!!!!!!! Hajajahah!!!", "Lol this made my night. I was feeling down and lonely.", "Source?", "You know how I know you're an ass hole? \n\nCuz I do that to my dogs too", "I wasn’t but am now feeling hungry.", "ears up = yes ??", "Oh my gosh is that great. I wonder if hungry is a trigger word ?", "The consequence of this is that the dog will eat parts of you when you accidentally say “hungry” in your sleep. Good night!", "Could be reacting to the emphasis and inflection rather than the word. To see if the dog actually knows the word I'd like to see him vary it so \"hungry\" is not always at the end of the phrase. Or substitute random words in in place of where he would say hungry. I bet the dog's ears still perk up if he says \"are you *purple*?\" the same way he's saying hungry", "I think he's doing somethin' off-camera for that reaction, but still sub-worthy ?" ],
      "Id": "lumotj",
      "Submission Name": "Are you \"hungry\"?"
    },
    {
      "Score": 13268,
      "Comments": [ null, "Why is it that all I can think of is the old joke about the Cat Scan and the Lab Results?", "Reminds me of my paw.", "Dr. Doggo: is oke fren, healin be done soon, then time for nappers.", "That looks so adorable.", "That dog is good at his job. The kitten seem to feel vulnerable.", "also, the dog seems to know that cats like head snuggles. 13/10 good doggo <3", "Dog*", "I need a reassurance dog.", "Dog: It'll be okay! I've been here before! They give out cookies at the front desk when your mom is scheduling!\n\nKitten: But shooooottttts! ;\\_;", "\"We got this.\"  - Bestest Doggie", "I mean, I too would be needing a doggo to reassure me when a giant 2-legged Bastard is about to cut off my balls", "A lab test, and a cat scan.", "ohhhhhhhh", "So adorable", "They are praying that this will be over soon", "Loving lab labors at the laboratory", "Dog, the ambassador of humans to the rest of the animal kingdom", "They work on cats too?", "That is the sweetest photo I’ve ever seen??", "Someone needs to hold that kitten STAT", "Cute", "Yo I don't want to be that dawg in your pound.", "This is beautiful! I don’t have any other words for this picture. My eyes are leaking??????", "I read “restaurant dog”", "Oh fur cute!!!!!", "Rule number one of the buddy system: Pick someone bigger than you.", "?????" ],
      "Id": "luo9pn",
      "Submission Name": "Reassurance dog at the vet"
    },
    {
      "Score": 13476,
      "Comments": [ null, "Do you know what breed of cat that is", "It’s a Squat. Squirrel and cat", "Or a Cuirrel", "Or a Squitty", "Looks like squirrel and needs pets.", "Me want Squat", "I think it’s a Somali?", "Seconded", "Don't know what breed, but she's posturing FOR breeding. That cat is in heat.", "Like cartmans kitty?", "just need a male squirrel", "Liiks possibly like a Turkish Angora.", "Angoras tend to be pure white or mine was with two different coloured eyes. ?", "Most likely a Maine Coon", "Sqat.", "Looks like a shaded silver maine coon", "Looks like a Maine Coon.", "My kitty has a tail like this! The vet said it’s cause her tail is extra flexible, I believe.", "I have a cat like that too. He's an American Ringtail [https://i.imgur.com/98vRco3.jpg](https://i.imgur.com/98vRco3.jpg)", "Need a pic for reference pls.", "I don’t have one when she’s furry but here’s [how she carries her tail ](https://imgur.com/a/mmZs8lO)", "I was sure that this would be a rickroll but it’s not", "Sorry to disappoint", "Is that kitty half husky?", "Half Malamute.", "Oh ok so pokemon are real now, that's cool", "i was thinking skuntank", "This absolutely looks like a creature from the Avatar: TLAB universe", "Tobi-kadachi", "*Duh-nun-nun*\n*\"Who's that pokemon?!\"*", "Catsquirrel! Caaaatsquirrel! All alone in the world is a little Catsquirrel!", "Cat squirrels and cat bats, I think someone is doing some interesting breeding....", "Bruh that's a Pokmon", "A squat? A catrrell?", "The crankiest of creatures in the whole wide world\n\nOur next cartoon features Slappy the Squirrel!", "Looks like squirrel and needs pets.", "My dog would chase this guy all day long!", "Maine coon female in heat", "Thank jebus it isn’t a squabbit.", "r/bottlebrush", "Huskatquirl\nHusky+cat+squirl", "Looks more like a chinchilla", "I feel like it's got a conflicted backstory", "Amazing", "[Fou, is that you?](https://static.wikia.nocookie.net/fategrandorder/images/3/39/Foukunimage.png/revision/latest?cb=20161119051236)", "Squirrel. \n\nCat. \n\nCa-rrel? \n\nSqu-at??\n\nSquat.", "That’s because it *is* a cat squirrel.", "A scuat if you will", "A Squat", "Squatt", "I call it a squat", "This sounds like it should have been a show from my childhood on Nickelodeon", "I would never stop petting the fluffy tail..", "The two have combined to defeat the dogs once in for all", "To catch the squirrel, you must become the squirrel.", "So Cute", "Ah, a squat.", "**No, it's a** ***catuirrel.***", "A Squat?", "A cat squirrel with the color of a husky", "You must have photoshopped a cat onto a squirrel…", "He should be named Professor Quirrell! IMHO?", "That cat's got a poofy tail", "We've done it. We've created the one thing that dogs hate the most. \n\nThe scrat.", "Whoa!", "What an incredibly floofy tail.", "...by Cream", "Scat", "Kirby ate a squirrel..and a cat?", "His tail be a duster", "Very cute.", "Majestic as fuck", "@yourpalross", "Its like in sonic adventure battle when you give your chao one of those little animals and it adopts a feature from it. Someone has been giving this dude squirrels. Or cats to a squirrel.", "Oh... he’s looking to infiltrate the squirrel community...gain their confidence and BAM! Get the secret to a real super fluffy.\nThe whole operation should take a little over a year, but Mr.Fluffysmoochieboochie...you’re the best we’ve got. We’re counting on you!", "Why is its tail so fluffy? Someone put a squirrel tail on it, I'm sure of that.", "It's a hatel husky+cat+squirrel", "Just wait till the dog finds out about this", "Which one does it taste like though?", "Is that a Pokmon?", "The new Pokmon graphics are insane.", "Nah. That's a Cusky.", "Squitten", "Professor Quirrel?", "Photoshopped!", "Dare you to dress it up like a skunk this Halloween", "I actually thouhgt it  was a squirrel lol", "You are what you eat" ],
      "Id": "luo6ak",
      "Submission Name": "It looks like a cat squirrel"
    },
    {
      "Score": 23441,
      "Comments": [ null, "somebody get this dog to a pool stat", "he's ready af for a swim", "Good lord how much rain was there", "In Asian terms, that’s just a mere shower.", "You see that grass in the background? So green it may be radioactive ??", "Up north we call that a light drizzle", "In NY I believe we used to call it \"liquid snow\". If I'm remembering correctly, it only fell on holidays and weekends during the sunny age... It was so long ago now, I may be misremembering.", "7", "Oh man, if that pavement is warm too, that's the best feeling.", "That smell that hot pavement releases after a warm summer rain always intrigued me as a kid. Anyone else?", "Petrichor :)", ">Petrichor\n\ninduces happiness in dogs", "And humans", "Texas nods in approval.\n\nI remember about 15ish years ago we had the longest drought in history in the DFW metroplex.  Our local lake dropped like 10+ ft and it’s not a small lake at all. \n\nWhen it finally rained, I just went outside and looked up, and let the rain just wash over me. It was magnificent.", "I love that smell. I'd put it up there with newly laid pavement.. wait I see a pattern...", "Lol damn TIL", "Or that freshly cut grass, you can smell their tears", "I still haven't been able to decide if I like it or not. Like I don't dislike it, but it isn't like a clear cut win like freshly cut grass, or new car smell.", "Yeah that’s a fungus, but yes it smells amazing", "Petrichor is actually not fungus. I've heard a lot of people say that, but it's when dry soil and rain make contact and the soil is dug up by the rain", "Interesting. \n\nhttps://earthsky.org/earth/what-is-smell-of-rain-petrichor", "This article is mostly proving my point, though? \n\n\"The main **Contributor** to Petrichor is 'Actinobacteria'.\"\n\nWhile, yes, you're right in the sense that when rain hits the ground, living plants/bacteria bestow a moderate part of the scent, it isn't the full thing. Petrichor is a smell, not a living plant (Fungi)\n\n\"When raindrops fall on the ground, especially porous surfaces such as loose soil or rough concrete, they will splatter and eject tiny particles called aerosols.\"\n\ne.g. When rain falls, it digs up dirt and releases aerosols into the air, causing the smell of Petrichor.\nPetrichor is not a fungus; part of it's smell may be contributed by fungi, but unlike you said, it isn't solely fungi itself. As per your article you provided, \n\"This smell (Petrichor) comes from the moistening of the ground.\"", "No i was never saying you were wrong, i was wrong.", "Oh I'm sorry ;-;\nThat's my bad, I apologize I'm so sorry", "Lol, things don't bother me like that.", "My dog LOVES laying on hot pavement in 90+degree weather. He’ll literally lay and roll on it when it’s 90’s out with a real feel of 100+.", "Yeah not gonna lie, I'd probably be doing the same thing as the pupper lmao", "I would too. That's how I know it's awesome!", "It’s a shame that I can’t enjoy playing in puddles like that anymore.", "Not with that attitude.", "That’s true.", "You wanna splish splash wif me?", "https://youtu.be/mZTb8WxEW78\n\nDont worry we all want to", "Song isn’t the same anymore after you watch clockwork orange", "wrote the exact same thing before I saw this", "I hate to mute this because of that very reason.", "It's a shame that there are so many people who will not watch \"Singin' in the Rain\" because it's an older movie.  \n\nSame with \"Twelve Angry Men\" and \"Inherit the Wind\".  \n\nOh, and \"Sound of Music\".", "I’d be so worried about cars", "Loll this is England, there'd have been 'No passage, flood' signs everywhere.", "I was about to say that.", "Let's all take a splash out of his book!", "Loves rain, hates baths\n\n- this dog probably", "Labs being labs", "This reminds me of being a kid with rubber boots running around in the rain", "My dog loves rain and water to, wish he never think the same way of entertainment.", "Water looks questionable", "Thank you.\nMy first thought was that I hope this dog's vaccinations are up to date.", "Im  only happy when it rains!!!!", "First thing i thought of.", "Im only happy when its complicated", "Needed that.", "Sometimes you just have to play in the rain \n?????", "I’m always amazed how most dogs will resist taking an honest bath, yet dive into any puddle without hesitation.", "Looks like he’s in one of those surfing pools. Someone get this dog a surfboard! ??‍??", "It's important to enjoy life you never know when it might end it's a blessing to be able to go outside and be greatful your alive let this dog have his fun.", "Dog is joy spelled incorrectly.", "I hate the music behind every video now", "God I hate when people add music", "Love your username", "Thanks buddeh", "cheers guy", "Same, and add that to the fact that you basically have to go out of your way to add it makes it even worse somehow for me", "u/savevideo", "That's a good dam dog", "Dam dog! :)", "Lol my dog did the same thing when he was playing in water...?", "I know a pup or two that would def do this!", "And I bet he runs and hides when he hears the word \"bath.\"", "reminds me of growing up in the Caribbean", "? I'm stiiiiiiinkin' in the rain....", "Hasn't everyone seen these while walking in the rain and wanted to slide down them like a waterside?", "My dog who passed away in 2014 would just as soon hold his pee for a week, before he would step outside in a drizzle.", "u/savevideo", "You need so little to be a happy boii", "u/redditspeedbot 4", "u/savevideo", "I'm sorry but the song singing in the rain takes away the wholesomeness of any video away for me ever since I've seen A Clockwork Orange", "Labs, man.", "He's so cute. He's doing what I want to do every time I see a puddle.", "Somewhere down that hill, post10 is unclogging a storm drain", "Yhe6 recordin6 is way too short ?", "I shook my phone and it took me here.", "It's it a flood?", "Is there a ***better*** video on the Internet? Probably not", "r/waterdogs", "Poseidon dog", "All fun and games until the rain takes him to a sewer and he gets eaten by a clown", "I wonder how many times I've already seen this posted before?\n\nHalf a dozen?", "u/savevideo", "u/savevideo", "Doggie Slip 'N Slide!", "u/savevideo", "u/savevideo", "*in a drunk nicolai voice* dacing in the rain", "u/savevideo", "u/savevideo", "A labrador doing what labradors do...  ????", "That's a typical bloody labrador for you...", "Where is that? So green", "This dogs happiness is proportionate to my unhappiness when it rains", "Anyone else terrified a speeding car could come by any minute. ?", "“The Durango 95’ purred away real horror show!”", "Labs ya got to love it", "Labs are the happiest, most loving, most goofy dogs in the world!", "Living his best life!", "Labrador labradoing what a labradog labrado.", "It's sad that the first thing I think of is that the water is so amazingly clean. It'd be nasty if anything played like that in my city, it's a cesspool by comparison.", "There's so much toxic chemicals on streets.", "Where was it?", "The Art of Washing Dogs in the Rain.\n\n&#x200B;\n\nIt's a lot less depressing than the version with Amanda Siegfried, and you're less likely to watch it on a Greyhound", "Labs are just pure happy.", "My springer spaniel I had for 8 years before he passed absolutely loved the rain, he loved being wet period. He would roll all around in the mud  then decide to jump the fence into the pool to get cleaned off", "Reminds me of my time at Cuba as a child. Every time it poured we would get in our bathing suits or clothes we didn't mind getting wet and we would slide down the steep hill we lived on with the water and played volley ball.", "This is such a lovely song.", "And thats how my golden gets ear infection lol", "So fresh", "I used to do that.", "The illusive dogfish in it's natural habitat.", "Yeah", "u/savevideo", "This is what i want my life to be. No more responsibilities, return to doggo", "Himb doin' a H A P P", "“Get me inside that”", "Doggo that’s dirty maaannnn", "The water is actually pretty toxic...", "[deleted]", "Get a grip and lighten up Francis" ],
      "Id": "lum8p6",
      "Submission Name": "Dog being happy in the rain"
    },
    {
      "Score": 54158,
      "Comments": [ null, "Stop it! Stop it right now!! I CAN'T TAKE IT!!!", "My pulse gets faster and I start to sweat. I don't have a dog but I need one.", "Hecin pupper", "If cuteness overload was a video this would be a top contender...", "It physically hurts me that I can’t just fall down on the pavement going “c’mere ya goober.”\n\nWell, I *could,* but without a puppy here people might look at me a little funny.", "Right", "We lost our 11yo Winston (GR also) back in August. This brings back his memory. Such a sweet face.\n\nThank you.", ">*'This brings back his memory. Such a sweet face...*'\n\n----\n\nLook into my puppy eyes, n tell me what you see -\n\na face so sweet n loving, n perhaps a memory...\n\nthe eyes who loved you long ago, n looked at you, above\n\nthe innocence of puppyhood,\n\nthe  eyes so full\n\nof Love!\n\nn maybe you'd forgotten, when we sadly had to part\n\nbut now these eyes stir *something* that's forever in your heart\n\nn maybe it will help you, friend, if only for awhile\n\nremember me, \n\nn don't be sad -\n\nthese eyes would make you\n\n*smile*\n\n??", "A fresh Schnoodle!???", "I started the day watching some RE:Zero and now this Schnoodle? Guess I'm just gonna cry all day.", "Best flowing schnoodledoodledo yet", "Ok, this one has made em cry but thanks, Schoodle,truly beautiful and so true. I remembered by cats and dogs.", "?", "These eyes made ME smile.... I want to boop, hug and scritch this sweet, darlin' puppy! ???", "It's been a while since I've witnessed a genuine Schnoodle. Thanks for the smile!", "It’s so lovely of you to write poems for us, but especially for someone who lost their best friend ??", "I miss mine too even though he’s still alive. I really want to get another one, but I have to wait till I have a yard.", "I’m genuinely sorry for your loss. Hope you’re doing better nowadays. Sorry if this sounds bland, I just understand how you feel.", "> We lost our 11yo Winston (GR also) back in August. \n\nWhere did he go?", "Why can't I save this as a GIF? I need this in my life", "u/savevideo\n\nEdit: tried to help you out with a link, but instead of the normal reply comment, it sent me a message with the download link.", "I can't believe I didn't know about this! Thx", "Glad to be of service. Use it for good, kind stranger!", "u/savevideo  .\nHere's it [is(link)](https://ds.redditsave.com/download.php?permalink=https://reddit.com/r/aww/comments/lujxj6/those_amazing_eyes/&video_url=https://v.redd.it/ch2qnouzv8k61/DASH_480.mp4?source=fallback&audio_url=false)", "puppy eyes are a leading cause of global heart warming.", "I like to think that’s a finger", "Is that a knee or just a giant finger?", "Looks like a forearm and the hand is scratching the cutie’s little chest", "Awwwww!! Just do what he wants already!! Those cute eyes are irresistable!!", "Sweet baby seal face!!!", "Pet the damn dog!", "You can see from the movements that the chest is being scratched.", "r/petthedamndog", "Awww what an Angel baby?", "username checks out", "Even the antichrist can't resist a golden puppy  :)", "Goldens are overall the best dogs and I will fight you over that", "Before I got a dog Someone told me nothing will ever look at you like a golden retriever.   I got cross at my golden last week when she was bad and she looked so sad that I cried.", "For a second I thought that was either a very big finger or very small dog", "Be still my heart....", "Adorable land seal", "Puppo", "Sweet golden baby.", "Are you freaking kidding me?! Does this dog want a home because I’m ready to rescue it right now!", "Adorable!", "u/savevideo", "Bless", "This is amazing.", "Awww so cute", "Soooo Cute:)", "Now that's what I call, \"Puppy Dog Eyes\".", "Beautiful and adorable ??", "What a super cute little fella! <3", "This is pawsomee ??", "WANT", "My heat is now melted beyond repair", "I AM DYING   \nTHIS DOG IS TOO CUTE.", "I want one now", "What kind of dog is this? A golden retriever?", "Pupper", "I needed that, thank you", "beautiful eyes . love it!", "Super cute:)", "That amazing face!!! ?", "Aww", "Land seal", "Where is this puppy? I wanna take him home with me.", "Everytime I do an internal \"Aww\" at a dog on the internet I feel like I'm cheating on my irl dog.", "so cute", "Though you can’t see it, tails waggin or butt is ??", "Doge", "So cute when dogs press their heads against you. I love scratching my pits heads and ears and they push up against me. Must be pretty annoying not being able to properly reach and take care of your itches and such", "Best thing I have seen all day", "What a sweet beautiful pup.  ????", "Maybe the dog is wondering what you taste like.\n\nJust saying.", "Oh hes so cute!", "That wee face makes me realise everythings gonna be alright.", "Even as a cat person I gotta admit this is cute", "My roommates just got a golden puppy and he looks identical to this", "Killer eyes ?\n\n&#x200B;\n\nEdit: Really sad that the puppy period is so fast.", "So cute!", "Man I wish I had one of these adorable ones...?", "really cute eyes", "The eyes that make we forget about everything that's wrong with our lives", "Too Cute!!", "Boop", "Amaz-a-eyes!", "????", "The internet is conspiring to make me buy a golden retriever.", "Aww lil pupper", "u/savevideo", "A dog that cute you don't eat all at once!", "u/savevideo", "The urge to cover it in kisses is incredible", "Y no boop?", "Those eyes make everything bad in life disappear", "u/savevideo", "Why do some dogs have almost pure black eyes while others have very human like colored ones", "Soft as silk! Look at that good dawgy", "What an adorable pupper! His eyes are full of love", "What a good boi", "My cute aggression is off the god damn chart", "Is this a labrador?", "Dunno, but it's certainly labradorable", "OMG  \nSo cute ?", "LAND SEAL", "My dog rests her chin on the sofa and does the “puppy eyes” like this with her tail wagging - asking to get up on the sofa or for attention. She’s adorable, I love my dog. :)", "God I need a dog", "But is he a very good boy?", "Awww", "u/savevideo", "Precious", "So beautiful and so aware....??", "My dog gas these exact eyes. I can’t help but harass him with pets whenever I see him", "Humans don't deserve the iron clad loyalty nor the unconditional love that dogs show them", "Such a golden thing to do. Mine makes his head feel like it weighs 40lbs when he does this. Steadily increasing downward pressure until you start scritchin", "I'm completely enchanted by those eyes!", "And those eyelashes!", "Does this remind you of someone, Dean?", "Not to be dramatic, but I would literally die for this dog", "I am glad this showed up right below that creepy vampire looking cat, my faith in this sub has been restored.", "Oh my love .", "Oh, that’s a good puppy!", "They don't call it \"puppy dog eyes\" for nothing.", "Specifically designed to make you melt!", "/u/savevideo", "[removed]", "\n/u/Notartboo, your comment was removed for the following reason:  \n\n* Instagram links are not allowed in this subreddit. You may submit another comment with a handle (e.g. @example), as long as it is not a hotlink. (this is a spam prevention measure. Thank you for your understanding)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/aww) if you have any questions or concerns.*", "I miss my dogs puppy dog stage but hes perfect just how he is now", "So cute", "I can't take it. I miss my little Donny  in Heaven.", "Golden retrievers...everything a dog *should* be.", "There black", "Dog are the best.  Unconditional love!", "Did anyone else initially see this as a finger propping up the chin of a 2 inch tall pup?", "the cutest!!", "The stage where puppy's are incident until they grow up and become a pain in the ass lmao. It's always a joy to have a animal that's always happy to see you when you come home they are family. He's adorable", "Cute!", "Adorable", "I want to steal  your puppy so much :)", "u/savevideo", "Nuuu! My mom says we can’t have three! Don’t give me that face", "Those two eyes hold all of the love in the world", "Eyes go brrr", "r/petthedamndog", "One feels the need to pet", "Golden puppies (and pittie and lab and shepherd puppies for that matter) turn me into Holly Hunter’s character from Raising Arizona. I love them so much I wanna cry.", "You stole my heart pupper", "Just a baby... Sweet, sweet baby.", "u/savevideo", "u/savevideo", "u/savevideo", "u/savevideo", "u/savevideo", "u/SaveVideo", "U/savevideo", "u/savevideo", "u/savevideo", "u/savevideo", "u/savevideo", "u/savevideo", "u/savevideo", "u/Savevideo", "I raise you my guy https://imgur.com/JKvTyn9.jpg", "u/savevideo", "That's a huge finger", "That's a big finger.", "My dog has better ones.", "r/PetTheDamnDog", "Sometimes I see something too cute and I just think I want to beat it up, not in a sexual way, I can’t take it", "OMG the eyes are black. Just like my slaves.", "Those eyes would be great for my collection!", "the downvoters probably eat meat" ],
      "Id": "lujxj6",
      "Submission Name": "Those amazing eyes"
    },
    {
      "Score": 15996,
      "Comments": [ null, "That black cat has the prime spot and is loving it!", "And knows it", "The black cat owns the couch", "The black cat owns ~~the couch~~ everything", "the other cat is just stuck in the middle of everything and is just accepting it like \"welp I guess this is my life now\"", "I feel like he’s annoyed at the downgrade of sitting with his doggy siblings (even if they are the same colour!)", "welp this is my life meow", "The cat reminds me of this Scrubs doctor:\n\nIt's MY human. MINE! \n\nJD: _I just want a bit of.._\n\nMY human!\n\nJD: Whose human?\n\nMY human!\n\nTurk: did you have to do that?\n\nMy human! My human! My human!", "I'm a CT tech and I lose it at the Radiologist yelling MY MACHINE every single time. I reenactment it to myself all the time", "Meanwhile, the ginger cat is like, \"Dang, got the butt...again.\"", "Cats and dogs love the butt spot!! It’s warm and smelly :-)", "Yeah, we know who the alpha is in that house.", "I literally didn't even see The Void the first time I watched it.", "If you get a bigger couch, you'll need more pets! It looks like they like the closeness.", "I like how you think.", "I was going to say, it seems like the right size to me. My cats all sleep with me every night, and my exes dog used to always join us. Four cats and a pitt/heeler mix sharing a twin xl was always the best thing in the world for me. I miss the dog, the bed feels so empty without her.", "I like how they color coordinated themselves.", "I so laughed when I read this!", "Wow amazing !!1", "I could never do this with all mine. Always some drama going on that I don’t fully understand.", "It's pawlitics, best left to the professionals.", "Pawfessionals", "Purrfessionals.", "Damn, the heat from those animals.. I would stand about ten minutes before getting too hot. A shame really, cause its real cozy laying with dog or cats", "Not to mention the hair accumulation and odor.\nAnd yes I love cozying up with pets. :)", "Everyone looks so relaxed.  I hope no one rings the doorbell", "It doesn’t matter. I have an L shaped sectional where there should be plenty of room for everyone to stretch out but it’s always me under a pile of dogs as a tumbleweed rolls across the whole other, unused end of the couch.", "He can never move", "The resident cat occupies 90% of a king-size bed so the space from a bigger couch will just be absorbed by the 4-legged bosses, most likely leaving the human with even less space!", "I looks like the perfect size to me.", "I’m sneezing", "Nice, Ron..", "What?? I’m not allowed to sneeze?", "https://m.youtube.com/watch?v=wzUK1c_lKNo", "Bless you.", "Thank you", "I Love them. I love them all", "life goals!", "That couch belongs to the pets. Buy a new couch for the humans", "They would migrate.", "True. The humans must sit on the ground", "Don't have a wholesome award :)\n\n ?????????????????????????????? ?????????????????????????????? ?????????????????????????????? ?????????????????????????????? ?????????????????????????????? ?????????????????????????????? ?????????????????????????????? ?????????????????????????????? ?????????????????????????????? ?????????????????????????????? ?????????????????????????????? ?????????????????????????????? ??????????????????????????????", "These puppers are beautiful! Anybody know the breed?", "Instagram link not allowed. This is from the ginger_cat_and_vizlas.", "They are called vizslas (veesh-la), they were bred for bird hunting in Hungary, and they are wonderful dogs. I had one growing up and she was the most energetic dog in existence. The ones in this clip aren't purebred I think, they are much smaller than usual. Very similar looking to weimaraners, but instead of that grey/blue, they are this gorgeous reddish/brown. Total sweethearts, and nicknamed Velcro dogs because they love staying close by. Our would run for hours and hours, and still want to play. Makes my parents Border Collie look lazy in comparison", "/r/IDmyDog", "[removed]", "\n/u/Hunnybeardontcare, your comment was removed for the following reason:  \n\n* Instagram links are not allowed in this subreddit. You may submit another comment with a handle (e.g. @example), as long as it is not a hotlink. (this is a spam prevention measure. Thank you for your understanding)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/aww) if you have any questions or concerns.*", "Perfect Sunday afternoon nap ?", "Last doggo is like “I wanna touch the hooman!”", "Black cat sings: I can take your man if I want too! News flash I took your man!", "I love your catwheel", "Yeah I was wondering where they got it.", "Need a smaller hooman", "I really just want to know how that wheel in the background works.", "The others probably have to ask the black one for permission.", "Even with a bigger couch they will all pile on top of you. ??????????", "Family", "We bought a bigger couch and we're still cramped up on one side. Wherever we sit, that's where our dogs have to sit with a whole half of a sectional unused.", "Looks like the perfect size to me", "They all look pretty happy.", "I dunno what the problem is .....? Ya'll fit just fine.", "WHO IS FILMING THIS", "I feel like the couch is exactly the size it needs to be", "Black cat: ugh we need another couch for the human\n\nOrange cat: zzzzzz\n\nFirst dog: hey hi everyone okay okay time to sleep more\n\nSecond dog: when did we get a cat?", "This is why I love dogs and cats", "Obviously you need a bigger couch! Then you could get a black dog or two so the black cat matches too.", "Turn your heat up!", "Looks like the perfect size to me", "If you humans didn't insist on using it there'd be enough room.", "Can you post a picture of your cat wheel? Did you make it yourself? Thanks", "If you're on Instagram, check out my account @ginger_cat_and_vizslas. I posted a video of the cat wheel two days ago. Yes I made it myself almost a decade ago. Unfortunately I don't have any plans anymore for how to build it.", "No you don’t. It’s perfect", "How does one acquire this many friends", "I gave my hugz award because that’s what all of them deserve", "Well, I think I see who’s the favorite!!", "THE definition of a \"cuddle puddle\"", "The Cats like: \"This is my spot, you can join the orange end\"", "Not really. If you got off, they'd have enough room.", "Where is the person taking the video supposed to sit? ??‍??", "Yes! ?", "I usually have to get off the damn thing.", "They need a blanket to hide under.", "That is the cutest thing I have seen all day. Thanks for sharing it.", "Sectional?????", "So cute", "Now that's the best way to spend a weekend!!", "Nah. The animals are more than happy to curl on top of and through legs or on top of other humans.", "Those cats tucked in there!", "That guy needs 3 laps", "Awe. So sweet!", "This isn’t a problem ?", "My dream", "Looks perfect to me.", "nah you need another couch, just for them", "oh my god thts hilarious", "Someone cut those dogs nails", "Nah looks good to me, you could even squeeze a couple more cats or smaller doggos in there tbh", "Dream couch", "This looks like heaven but my allergies would never forgive me", "u/savevideo", "My dog is 200#, we gave up and got him his own couch", "Really loving the color coordination here.", "If you got off the couch it would be big enough for all?", "r/dadswhodidnotwantpets", "soot sprite on their chest.", "That black cat is actually Rufus Sewell with a beard.", "Dude, I hate to break it to you, but people with pets cannot wear black fleece. Ever.", "It bought a massive couch, it does nothing. Theyll still sleep on top of tou.", "Personal space or Vizslas. You can only pick one.", "That is the dog foot warmer cuddle technique", "This is my life goal. \n\n&#x200B;\n\nIdeally with a slightly bigger coach though.", "No, that’s enough space for me", "How many pets do you need", "Is that a leg coming from under it?", "Whaaaa? That couch looks the perfect size!", "Those dogs are sooo cute", "I have a king size bed, and somehow my 2 dogs manage to lay in such a way that I only get like a 2' wide strip on the side... the rest is theirs... lol.", "I had the same problem just get rid of the hairless ape and your fine", "This sure hits home ?", "looks like heaven tbh", "That’s a family that knows how to couch.", "Damn, life is good.", "F the cat...make way for the Vizsla.", "This is the most beautiful family I have ever seen", "Adorable!", "....and a bigger lint roller.", "They look so sweet and cozy ??", "The pack just chillin.", "I love scenes like this. Heaven to be surrounded by your pets that love you.", "Nice house", "That man is loved", "Yes officer I’d like to report a caucasian man slumbering above the legal snuggle limit", "Looks perfect to me!!", "Man this makes me wanna go home and snuggle up with all my girls...", "I think the black cat is the f'ing boss.  The poor, tan animals all look scared of him!", "They definitely get in where they fit in.", "The definition of lazy saturday", "Then you can get more pets!! ??", "I thought it was a picture and I saw the cat blink and I was terrified", "Based on the cats, I assume your heat is out. Hope it gets better soon.", "Some adoptive children like their parent !!!", "The black cats face says: mess with my homan and I slap u\n\nThe orange cats face says: I'm not a pillow", "Does anyone know what breed the dog is? Looks very similar to my rescue and in trying to figure it out", "No.... there’s still a spot behind the front dog’s butt. And a couple of cats could go on the back of the couch. I see potential.", "Awwww", "Gotta love how the cat has such a look of superiority while snuggled in a shirt", "Why? Your pets seem comfortable?", "u/savevideo", "You stole my black kitty!" ],
      "Id": "lukzqc",
      "Submission Name": "We need a bigger couch"
    },
    {
      "Score": 12280,
      "Comments": [ null, "Perfect form! 10/10\n\nCan’t wait to see them in the olympics", "You mean Doglympics.", "I dont know i heard competition there is ruff!", "Plus, they keep the athletes on a really short leash.", "Things often get hairy there as well.", "If it's anything like the Puppy Bowl,it won't be as fun as it sounds.", "Might be the worst attempt at a pun I've ever seen", "Russia: 7/10", "For those curious this is at St.Peters Pool, Marsaxlokk, Malta", "Yeah whike I was watching the video was like \"That stone looks like Malta. Is this Malta? That's Malta!!\"\n\nIt's cool to see Malta on here xD", "While I thought it looked like Matala", "When only the right spot will do", "And here I was thinking he was running along the beach to avoid the 1/2 meter ridge, then he kept running on past the flat bit...", "I love how the pup weaves his way through the legs of people standing around and then makes a bee line for the cliff ???", "i have a jack russel, and they excel at the leg weaving", "Oh wow, that's impressive! What kind of legs do they prefer to use? Alpaca? Shetland? Can't be Angora, can it?", "Does he give him a plastic bottle to hold for buoyancy?", "Considering the dog keeps its head above the water I doubt it. I think it’s to prevent the dog from accidentally drinking any salt water which will cause explosive diarrhea. \n\nSource: had a dog that would get explosive diarrhea after a day at the beach if she didn’t always have a ball in her mouth preventing her from drinking any of the water.", "How do I subscribe to top dog diarrhea prevention tips?", "Following", "I feel like that could be a brand new sentence", "Don’t let them drink salt water. If they’re going for a toy in the ocean, don’t throw it too far. \n\nBut, it’s always best to run them around the park before loading them into your vehicle. I’ve been very fortunate that they haven’t exploded in my car yet.", "I thought he was just a thoughtful little environmental protector doggo but this seems more likely.", "I think they’re just playing catch", "As another user said, this is at St. Peter's Pool, Malta.  Unfortunately, the dog passed away around 2 years ago.\n\nhttps://lovinmalta.com/news/local/titti-the-incredible-cliff-diving-maltese-dog-has-died/", "....I was having such a good day.", "Not sure whether to upvote or downvote, but leaving it alone seems bad too", "Bummed a little but she was living and loved. I appreciate the happiness this relationship created and shared.", "There is a reason why ignorance is a bliss and this is why", "Why post this", "Some people prefer truth than to be elated without the full story.", "How is knowing the dog passed away relevant at all to what this video is though? Lol", "Just saying man.", "Sad news indeed but thank you for sharing it. That wunder pup was loved by all.", "I’m just amazed that a terrier would want to swim like that. Most hate the sea.", "how will the dog get out of the water", "My fellow pup welfare worry warrior. <3", "By flapping its ears really fast", "So cute! I wish I had that kind of confidence on the diving board!", "I love Jack Russells. Fearless little feckers", "I wouldn’t be as brave", "That was definitely the cutest thing I’ve seen today.", "Looks very happy!", "Whenever this gets posted I'm at awe of how fit and goodlooking everyone is. Definitely not America.", "Speedo’s give it away", "Nah, we have quite the obesity problem here too (admittedly less so than America, but the most obese in europe)", "Little Leap of faith?", "Is that a empty water bottle so the dog doesn't drown if tired?", "Probably to stop it gulping salt water", "Love the puppy jumping just like that????", "Great splash 10/10", "CANNONBAAAAALLL", "Oh wow a Dogphin", "How does that belly flop not hurt?", "How would it be hanging out with that wee dog?", "So graceful (?‿?)", "amazing", "Yeeeeeet!", "I need a tv show just about this dog!!!", "Swim, doggo! Swim!!", "You can see the dog splat against the water then the water caves in", "BOING", "cracks me up every time.....anyone know where this was taken......never mind...im a dumbass", "Plop!", "Jack Russel Terrier, these are ruthless beasts", "Auunxjexiqkcjei weeeeeeee", "Am I the only one who thought scared that the dog was going to jump off the cliff? Yes? Ok.", "Tombstone!", "u/savevideo", "Every time this is posted it makes me smile", "It's an oldie but I never get tired of it.", "I double dog dare you! Lol, that was great", "Belly flop!", "Doglompic", "cutest thing i've ever seen.", "That dog is braver than me", "Holy cow - It would take quite a bit more coaxing for me to jump off that ledge.", "I've seen this so many times here but I love it so much every repost gets an up vote.", "Aww my Jack Russell hated the water- the only time she got in willingly was when she chased a duck into a pond.", "10", "Fearless.", "That form???", "Wow! That is amazing.", "Good form, 10/10", "Finesse", "What a fearless little dog. We should all be like him", "This video will never get old. I look forward to it every time.", "Ginger used to do that when I was a kid when I Jump then she jumped in", "The form of that dog!!", "Brave good doggo", "This is so Cute ??.. lil guy is So Happy ?", "Majestic", "Aww zoomies!", "This one always makes me smile. ?", "I wonder about his little belly ?", "There's a lot of conviction in that jump.", "I will watch this video everytime. I had a jack Russell and this is classic!", "Nice form!", "Once we were at the creek with our dogs, and county parks had just been mowed. \n\nThere was a swirl of grass clippings sitting on top of one of the deeper parts of the creek.\n\nMy dog went to jump across the creek and intended to use that spot as a kick off up the bank on the other side.\n\n*PLOOP*\n\nShe doesn't trust jumping near water anymore.", "CANNON BALL!!!\n\n???", "u/savevideo", "u/savevideo", "u/savevideo", "9/10 form.  Don’t arch the back on entry", "That’s my kinda dog!!!! My Yorkie used to Cliff jump with me", "He gave him an empty water bottle.  ?", "[removed]", "\n/u/d-fatat, your comment was removed for the following reason:  \n\n* Instagram links are not allowed in this subreddit. You may submit another comment with a handle (e.g. @example), as long as it is not a hotlink. (this is a spam prevention measure. Thank you for your understanding)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/aww) if you have any questions or concerns.*", "Unfortunately Titti passed away some time ago, but there's a new protege in town, owner got donated another puppy, Tina!", "That belly flop must have hurt!", "What a cool dog", "u/savevideo", "u/savevideo", "Dog got balls, not anymore tho", "That might have actually hurt him." ],
      "Id": "lulzbu",
      "Submission Name": "Swim time!"
    },
    {
      "Score": 1024,
      "Comments": [ null, "Free cave", "^(It's free real estate...)", "OP is a chick magnet.", "Beat me to it, damn it.", "I always wondered what it would be like to have four chicks in bed at once.", "Ong, too cute!", "My parakeet would do this when he was sick. Then I'd forget about it until I moved my hand and the sweat on him would make him seem dead. But he'd shake it off.", "You can say it's a.... handmade home. ? \n\nOk im out.", "But now you arent allowed to move your hand so hows it going", "Please don’t make a fist", "*splat*", "Crush them", "You wouldn’t dare", "CRUSH THEM under the weight of your love and affection.", "Seek help.", "Boring christmas eve 2012?  ^^", "Lol I knew I wasn’t the only one that had that thought pop up", "I don't like you.", "You need therapy." ],
      "Id": "luyak6",
      "Submission Name": "Making a hand-home for some tiny chicks"
    },
    {
      "Score": 6018,
      "Comments": [ null, "Ginger.exe has stopped working. Adjust tail and whiskers to reboop!", "Better than the \"I'm going to puke\" wretch.", "????", "Too cute!", "Let's talk about that long ass finger, jeez", "I thought that was a mlem?", "Dis iz mlem hooman ?", "isnt that finger way too long", "Went for silver; got gold!", "*Yoshi mlem*", "Maybe a double boop will equal a double blep. Dont know but the theory must be tested.", "That person’s index finger is twice as long as mine.", "So cute" ],
      "Id": "luno4n",
      "Submission Name": "Went to boop but got a blep"
    },
    {
      "Score": 12299,
      "Comments": [ null, "I would trust him to file my taxes", "I'd trust him to teach me quantum physics 101.", "Im worried he’s going to try and sell me a monorail", "Could be worse he could try to sell you on GME!!  lol", "There's nothing on earth like a genuine bona fide elactrafide 6 car monorail", "He looks like the 11th doctor who", "Bowties are cool", "I'm down for a dr who paw patrol crossover", "You know some furry artist will do that now", "Wow he's gorgeous!", "\"Welcome to the ministry of cuteness, how can I help you?\"", "Quite a dapper yapper.", "A handsome boy! Where is he going all dressed up?", "Leo looks very dapper. What breed is he?", "He’s a tri-color Australian Shepherd! He’s just 5 months so he’ll get a bit bigger than this.", "Extreme handsomeness.", "Leo looks ready to wine & dine", "He most certainly is!", "More well groomed than anyone I’ve seen in a video call at work, I assure you. Sharp Leo. You’re going places kid.", "Such a handsome pupper!!", "Gorgeous boy.", "Yes, he is! A handsome fellow with a sweet face. Give him pets for me.", "A fine looking hound indeed.", "Handsome is fitting", "He sure is!", "Yes he is", "He is the smartest looking dog I’ve ever seen! Very handsome ??", "10/10 handsomest doggo", "such a dapper pup\n\ntell him i would die for him", "\"Welcome to \"how to be good boi\" 101\"", "I would die for Leo", "What a dapper young pup!", "DAMMMMM he handsome", "He’s perfectly adorable", "Bill Nye", "The math teacher we needed, but didn't deserve", "Omgsh ??", "He sure is!  I want to scritch those ears.", "And he knows it.", "Adorable", "Dashing!  So cute!!!", "Oh my gosh what a handsome boy you have !  Love his bow tie on him.  He is stunning!", "My dog is named Leo as well", "What a gentleman! Oh gentlepupper ?", "I gave my only award because AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA\nI love him ? he’s so perfect", "He even looks like he's wearing a tux!", "Little business man :3 He would look cute without it too!", "Ohh you. You don't have to say that, thanks ?", "Such a dapper boy.", "He looks like my Comm Tech instructor", "I love his spats.", "He has got literally the same white markings as my cat", "Leo the lawyer", "Adorable! ??", "That's one dapper pupper.", "He certainly is!!! What a pretty pooch!!!", "I'm in love", "Indeed! ??", "He sure is!", "What a gentleman", "Look out, ladies!", "it's a good look, Leo!", "Sure he’s handsome but can he talk?", "Quite a dapper lil' lad, isn't he?" ],
      "Id": "lukevv",
      "Submission Name": "Leo is so handsome with his new bowtie"
    },
    {
      "Score": 430,
      "Comments": [ null, "I think she won", "Actually, she immediately knocked her king over which means she resigns and has no interest in playing chess, so I agree, she wins.", "ILL SHOW YOU WINNING", "\"Ah, interesting. Here's my counter.\"", "Checkmeowte", "Me: Pawn to E4\n\nKitty: Everything to everywhere ?", "“I resign”. **smash**", "Give this cat a Golden Globe!", "I saw it coming and I still love it", "r/Maybemaybemaybe", "u/savevideo" ],
      "Id": "lv2w9a",
      "Submission Name": "The cat's gambit"
    },
    {
      "Score": 26089,
      "Comments": [ null, "No one in the MCU is as consistently publicly just THRILLED to be there as Paul Rudd", "I'm pretty sure Mark Ruffalo is close", "I just can’t forget when he spoiled Infinity War live on tv.", "Lol, Feige can’t either", "The real reason there’s no Ruffalo Hulk movie", "Really?!", "No, it's weird licensing rights with the Hulk", "Yeah, Universal has the distribution rights. That’s why no Hulk movies are on Disney+.", "No", "[deleted]", "Sony owns the rights like they do for spider man and venom. I believe it was because of the Ed Norton movie was produced by Sony. It’s just Marvel and Sony couldn’t come to an agreement for the standalone film unlike Spider-Man\n\nCorrection: Universal not Sony", "It’s not Sony. Universal has the distribution rights to Hulk and Namor for movies.  So while Hulk can be in other people’s movies, he can’t have his own without giving Universal a piece of the pie. It’s why Thor Ragnarok was really Planet Hulk the movie and part of the reason She-Hulk is getting a TV show instead of a solo film.", "Thanks, my bad", "No I'm pretty sure if they make a Hulk movie Universal gets exclusive distribution rights. Sony doesn't own the character.", "I think it’s Universal, not Sony, that has the rights to Hulk\n\nEdit: words", "My bad, thanks!", "\"Hey so we want to make money with a Hulk movie. You could profit, too.\"\n\n\"No! Hulk is my toy and no one else can use him!\"", "Feige giveth and Feige taketh away", "Imagine being this gullible", "Watch the interview Ruffalo did on Graham Norton. Apparently on the night, Feige was not impressed, but the next day he called Ruffalo in for a meeting and told him that his stunt was \"Brilliant\" and that they had gotten so much exposure because of it. Lmao.", "What? I missed this", "It was during an interview before the movie released. I don’t remember what show or anything tho.", "i know remember that don cheadle was there with him and when mark said “everyone dies in this one” don was like “dude why would you say that”", "Also Tom Holland", "Tom Holland is another.  Maybe even Chris Pratt as well.\n\nMost of the MCU actors and actresses are pretty proud and happy to be a part of the Marvel family, from what we see.", "Quite a few of them do seem to be enjoying it as more than ‘just a job’ level.\n\nPaul Rudd and Tom Holland really do come off almost as if the are being payed to do something they would for free though.", "They're getting paid a lot, but also they seem to genuinely all enjoy being around one another.  \n\nTom Holland fucking loves being Spider-man.  I don't think there's any debate about that", "But really though, who wouldn’t want to be Spider-Man?", "I mean youd have to be a pretty rare kinda person to not be excited to essentially be a superhero.", "Understandable, with that kind of paycheck.", "“Is that Paul Rudd!?”", "One of my favorites of them is when they were asked which avenger they would switch with, and they both looked each other in the eyes, flew up from their seats, and switched places.", "Can I get a link for this please", "I don’t know if there’s a better video but Around the 8 minute mark of https://youtu.be/f8X5Qj9jAAI", "I forgot it’s that time Paul just flew off his chair! Haven’t watched that in so long. Thanks for the link!", "They didn't even need to exchange glances! They just both knew what to do without a second's pause. That's really great.", "I know where the shared joke idea came from\n\nMy brain found it too\n\nShe said \"If you guys could switch...(pause).. with any\n...\"\n\nYou could tell she was going to continue, but the punchline was already set up for anyone looking for a joke", "First clip in the set...Enjoy!  https://youtu.be/BVoXgn8DtgY", "I just realised the interviewers laugh when they were switching seats sounds like the background parts of bounce by timbaland lolol.", "I either want to marry, or be Paul Rudd. Either is fine.", "And bang Jeremy Renner.  And Thor.", "/r/bi_irl", "I actually am bi :p", "Same, it's how I recognized the feeling ?", "Shuri is really cool ?\nShort haired Thor is nice too.\nBut Antman and the Wasp are both...yeah... :)", "You'll get no arguments from me haha", "My ex was really glad and confused about my responses towards other women. “Great, we can both check out other women!”\n“...Hang on a sec...” We broke up before he realised the possibilities for a threesome ?", "Oof q.q", "I just want one of them to reply to a message on social media. I would never meet them face to face but it would be nice to have a single emoji like ?? or ? but your going the whole way so congratulations", "I wonder how many more years Rudd will be able to drink the eternal youth serum", "Rumour has it he's next in line for the throne.", "I heard he stole the secret formula from Tom Cruise.", "It's how he got the role for Ant Man.", "mm cruise looks like an older lesbian these days.. so I think that was a different potion", "Did he finally fall off the cliff? I actually haven't seen a pic of him since 2019.", "He's been busy filming the next Mission Impossible movie", "You mean planning another stunt which makes him breaks something to promote the new movie", "That's just because he lost his only copy of the secret formula. It's far too complicated to memorize.", "He snuck into Tom Bradey's house and stole the spice melange.", "Some say it's Keanu. The Keepers are having to dive deep into the old texts for this one.", "Look at an actual close up of him, the dude doesn't look *that* young.", "But for 51? Dude looks good", "he's looked approximately like that for the last 150 years or so though.", "And then Jeremy gave Paul raspberries", "Update: they are now married", "Update; & have 3 kids and a hamster", "Update: Paul, the three kids, and the hamster suddenly disappear in a vanishing cloud of dust. Jeremy has an unsettling sense of dj vu.", "Update: the press reported it, calling them 'friends'. The press, too, have mysteriously disappeared.", "Saw [this old interview](https://youtu.be/6AOJbMWD0LU) with Jason Segel and Paul Rudd yesterday, so if you like Paul Rudd (or Jason Segel for that matter) I’d recommend watching it.\n\nProbably the most fun interview I’ve ever seen lol", "This duo is honestly one of my favorites lmao I love you man is a classic", "Paul Rudd is what happens when you cast any average Joe, who's a fan of something, into that very thing.", "Average? Lol", ">Average? Lol\n\nAverage Joe is the brand he is marketed as. But you are right, he is defiantly not average. His job is to embody that persona to be marketable and not everyone can do that.", "Renner is 50 yrs old and Rudd is 51.  Two well preserved (and makeup'd) men.", "I wouldn't expect less from Renner, seeing as he was a makeup artist before getting consistent acting jobs.", "Damn never would've expected that", "That’s a pretty cool fun fact. I had no idea", "We don't deserve Paul Rudd. Hes literally like the golden retriever of humans.", "“Look at us.”", "Hey, look at us", "Who would have thought?", "Not me!", "That is so so funny! I caught Paul Rudd at a candy store he owns with Jeffery Dean Morgan called \"Samuel's Sweet Shop\" dude is just so friendly and down to earth, I asked him about did he have any stories about messing around with Marvels props like Cap's shield or Mjolnir in a video I put up on Youtube.... seems like he really is just like a little kid here! \n\nhttps://youtu.be/LEC_lkpD3rM", "I knew what it was and still clicked. Is this how Conan feels every time?", "Well played!", "I'd watch the fuck out of this porn", "What?", "This’ll", "Shouldn't this be on r/MadeMeSmile or something like that instead?", "Paul Rudd and Jeremy Renner just seem happy to be there, honestly. Glad they found success.", "i too would like to be inside paul rudd’s shirt", "Isn’t Jeremy Renner like an abusive piece of shit?", "How's it smell Jeremy?", "isn't Jeremy Renner a wife beater? I think pieces of shit don't get to be aww material.", "He also supposedly put an FN 5.7 handgun in her mouth during a argument.", "Wait, since when does the accusations of a single person without any actual proof mean he is guilty?  I can accuse you of beating me right noe, does thay make you guilty?  According to you?  Yes", "\" Things that make you go AWW! Like puppies, bunnies, babies, and so on ...\" Why is this an \"aww\"?", "Tbh I didnt realize what sub this was", "Yeah, it's amusing, but not aww-inspiring.", "Nobody but the parents go aww over babies.", "Well that's blatantly false. Lots of people don't like babies, but lots of people also really do.", "Good honest fun and friendship is *kinda* Aww i guess?", "Because some people allow celebrity and entertainment to occupy too much of their lives.", "Jeremey Renner appearing soon in a Paul Rudd belly button near you.....", "People in r/Justunsubbed it’s free real estate", "when will paul realise that he is also famous", "Is this really relevant in r/aww this isn't cute at all", "100% wrong sub. Please don't let this become a thing", "How is this aww?", "Didn't Jeremy Renner put a gun to his wife's head?", "Yes he did", "Where does this certainty come from?", "Allegedly*. Nothing is confirmed yet.", "[removed]", "He admitted to threatening her life. On the record.", "Source? \n\nPs.: find interesting that people post such an information without providing a credible source. And this isn’t about “google it yourself”. My comment, otherwise, states a common issue in custody disputes.\n\nPs.2: after googling it, still haven’t found your claim to be true, only that he states his ex-wife is a liar.", "And biting his child (allegedly)", "Yeah, that adds to my incredulity to her claims rather than the opposite.. if he really mistreated his daughter, he’d have done it multiple times and his explanations are sound about the ONE time she says he allegedly bit her..", "Idk why they downvoted you", "Aww, why are we forgetting that Jeremy is kind of shitty tho?", "These people are 50 year olds. \n\nWTF", "There is an interview of Jeremy wearing Paul’s face on his shirt too. It’s funny would recommend it for fans :)", "Paul Rudd is definately on the Jeremy Renner app", "How is this aww?", "I like how little fucks Jeremy Renner seems to give", "Remember when Jeep tried to convince us Jeremy Renner was a rockstar while he was leaving cocaine around the the house for his daughter to find.", "Do you think Paul downloaded the Jeremy Renner app", "Paul is a bae. He is way underrated.", "this is gross. maybe the grossest thing jve ever seen", "So you only browse r/aww then?", "(Whispering)\n\"I love it when your head is so close to my balls\"", "\"Due, DUDE, I have the best idea ever! Just gimme head! Come in me! It's gonna look so cool!\"\n\n&#x200B;\n\n\"Excuse me the FUCK? \"", "I am Hawkeye.", "Prove it.", "That's Rudd", "I assure you basically any interview with Rudd and Renner on the Endgame press junket is gold.", "Lol that is a little bit gay, ngl. (I'm Gay-I can say it damn it!)", "work smart not hard", "He's funny... I'm glad \"killer bees\" didn't hurt him.", "Paul Rudd is a national treasure.\n\nI'm low-key thrilled that he and I call the same city home.", "I think the best description of Paul Rudd’s overall persona was this, “Enjoying Paul Rudd’s happiness is the equivalent to the feeling of gliding your scissors through wrapping paper.” \n\nAccurate AF", "One of my favourite Paul Rudd [moments](https://youtu.be/Zuq8w8j235I)", "I would leave my husband for Jeremy Renner. \n\nDon’t worry, my husband knows this. Just like I know he’s leave me for Natalie Portman.", "Imagine the smell", "Paul Rudd and Mark Ruffalo are on the same level, but Paul’s more childish and it make him that much better", "Jeremy Renner has a app that’s total trash and you have to pay him for no reason at all.", "These guys would be fun to hang out with.  Not in a wow so famous kinda way, but just hanging with some goofy fun guys way", "xD", "How come no one talks about the fact Jeremy Renner vibe checked his wife with a revolver.", "I love this", "Two very old men trying to act like kids. This picture kinda sums up the public who enjoys superhero movies", "Better file down that edge so you don't accidentally cut yourself on it.", "I'd rather be an old man that still enjoys childish fun now and then than a 20 something that thinks everything must be serious all the time and hates my life", "Renner could have done some really epic stuff had he not done this crappy marvel stuff I recon.", "Yeah I can't believe he did that top-grossing movie of all-time. Geez, what a crappy decision. I guess being the lead in an Oscar-winning Best Picture movie that he was nominated for Best Actor wasn't epic enough." ],
      "Id": "lui4kl",
      "Submission Name": "This interaction with Paul Rudd and Jeremy Renner"
    },
    {
      "Score": 68130,
      "Comments": [ null, "Will his feathers ever grow back?", "They can grow back but if they pluck severely enough and cause follicle damage they won't.", "Just like my eyebrows!! I do feel bad for the poor thing. What a precious and spunky little bird. I hope op can explain.", "It's likely a rescue parrot. the previous owners probably took poor care of the bird leaving it to pluck it's feathers out of boredom. hopefully this guy is living the good life now.", "Not necessarily. Birds will pluck for a lot of reasons. If an owner dies, a member of the house disappears, or another new pet, or even a new baby.", "Boredom or stress, the main causes or nakey birds", "It's always stress. The 'boredom' in this context is the stress of being stuck in a cage 24/7 with nothing to occupy the mind, so eventually self-destruction ensues.", "That is very sad", "Yep this is a goffin cockatoo, cockatoos are netoriously bad feather pickers in general", "Yeah, we never had problems with pluking in our birds but when my mom passed our macaw couldn't handle and started pluking. She grew out of it though thankfully.", "Why doesn’t that work with ear hair? Asking for a friend.", "Or those pesky nose hairs. My eyes water just thinking about them...", "Meanwhile ive been plucking my unibrow for a decade and it refuses to die.", "Dude same ;-;\n\nI’ve got bad trichotillomania. I’ll be lucky if my brows grow back.\n\nI hope this little dude is in a much more loving home now that made him pluck! He sure seems to be.", "Really? After over a decade of obsessively plucking my eyebrows that has yet to happen to me. It feels like there is a never ending supply of tiny stubbly hairs that I must remove. I suppose that's probably a good thing, I don't care if I ever have eyebrows again, but I do worry if I stop having them to pluck that the compulsion would shift somewhere more problematic", "Now if only I could pluck severely enough in other places to keep it from regrowing...", "Sometimes but a lot of rescue pluckers will look like this for life.", "So sad! Is this mostly brought on by stress or are there other factors?", "I would equate it to under-stimulation and boredom. These guys live a long time and like a lot of attention.", "Yeah, parrots are really smart and very compassionate animals. Many species mate for life and constantly give each other attention and love. So if theyre being treated like an exhibit rather than an animal they’ll get super depressed :(", "> very compassionate animals\n\nCompassionate, my ass!  Mine just wants to destroy me.  Some parrots take to one gender only and see every person of the opposite gender as competition.  Try having a parrot bite through your eyelids.  Not very compassionate.", "Like a two year old with a sharp knife.", "Diabolical toddler with a canopener attached to it's face. Oooohhh the tantrums!", "Birds are a lot like cats imo. They’ll either love you or hate you.", "For my parrot, not a single lady is disliked but he hates 90% of males.  Blue fronted amazons are apparently notorious for this.  Wish I knew that before we got him.", "My lad will let a bloke he’s never met before pick him up and stroke him but will try to bite the woman who’s seen him most days for the last 7 or 8 yrs every time... unless she’s giving him treats! He hates women... bit of a problem tbh when I bring dates home lol they always want to meet him and it’s not great when I have to tell them he’s likely to bite!", "Is a cockatoo a parrot? The reason I ask...I used to live in Sausalito CA, a nice little town just north of SF over the golden gate bridge, and there's a guy there named Michael who has two cockatoos.  He does a mime routine with his birds on the street for the tourists (and has been for many years).  He will get the birds to pose with kids for photo ops and does some tricks, it's a whole show he puts on.  Well one day I'm having a beer at the bar, and he comes in to take a break.  So he and I are in the back of a no name bar (don't ask me the name of the no name bar) sitting together at one of the tables having some light conversation.  It's very mellow, 2:00 in the afternoon, just a few regulars hanging out   He's got one of cockatoos with him, perched on his arm.  After a few minutes the cockatoo gets off of him and walks across the table and perches on my arm.  Cool!  (I know nothing about birds by the way).  So we are just sitting there sipping our drinks.  I'm moving real slow, I don't want to disturb the bird, and it's a pretty cool moment for me.  The bird, out of nowhere , means over and takes a chunk out of my ear.  Ive got a crease in my ear now.  I'm bleeding all over the place.  So...I'm a bit leery when people say parrots are compassionate.", "Cockatoos are parrots, yes. But they definitely can be compassionate.", "This. People neglect the intelligence of animals and keep them in conditions that are psychologically and emotionally damaging for them. \n\nParrots are incredibly intelligent, social animals that, in their natural state, have flight ranges of miles. If they’re neglected and under stimulated in captivity (which is often the case as most people don’t do their research and treat pets as objects) - it leads to stress and depression which triggers compulsive behaviors such as plucking. It’s mental health is/was strained to that point at some point. \n\nIn humans this behavior is called Trichotillomania and it happens for basically the same reasons. \n\nI’m all for keeping pets, when you can keep them properly and take their quality of life as top priority. Betta fish need more than a tiny cup, birds need more than a tiny cage, reptiles need more than a tiny enclosure with paper towels at the bottom. If that’s all someone thinks is necessary, they lack the empty to keep pets and therefore shouldn’t.", "Never underestimate the stupidity or malice of man -Joey Santore aka crimepaysbutbotanydoesn't", "Everyone getting a pet, no matter the species, should know this. I'm all in for some kind of pet license", "Stress can do that....saw some macaws in Guatemala starting to pluck their feathers because they were being exposed to tourists. I am an ex bird owner and I watched the video....hope he/she gets 'em all back!", "Stress caused from an unenriched environment, neglect and boredom mostly.", "I met a parrot once that did this after their life long human died, so that can cause it.", "My rescue got some back, not all. She wasn’t a plucker when we got her so I don’t know exactly what happened to her, maybe mites, but she lived her best naked life with my family", "I thought this was just a baby who was still growing feathers. Finding out in the comments that it was just stressed from being neglected made me sad.", "Me too ! Very sad.", "I came here for the dancing and stayed for the music.", "Some of these birds can dance better than most humans", "Because they aren't human, so naturally they are dancers.", "Are we human\n\nOr are we dancer?", "Or are we hamster\n \nMy waters empty\n\nMy cage is cold\n\nAnd I’m on my wheel\n\nLooking for the answer \n\nSo are we human?\n\nOr are we hamster", "Underrated comment. This made my morning", "Time difference always gets me *slowly shakes my head*", "Man... I went from loving their music to absolutely hating their newer stuff.", "I think their latest album is one of their best tbh. It's a different sound than Sam's Town or Hot Fuss but I'd consider it in the same tier as those", "Saaame, Sam's town was their peak in my opinion. I think sawdust was like their last good album.", "That’s most bands.", "Yeah I’ve seen it happen over and over as I followed bands and gotten older. There seems to be a peak period of inspiration and creativity for every songwriter and band in their 20s and then they are just chasing the dragon from there on. There are a few exceptions that stay consistent through their career but most that I know of are bands with cult followings that never hit too big in the mainstream.", "in 8 years, The Beatles went from bubblegum pop to Abbey Road\n\n8 years", "maybe i am a naked bird", "Just don't get that line, don't know if I'm missing something or it's really poor English?", "Some of these humans can dance better than most birds", "Happy cake day!!", "Happy Cake Day!", "The Humpty Dance", "Both the music and the bird's dance moves took me straight back to middle school, lol", "I wasn't alive when this song dropped. (amazing username btw)", "Me: *Cries in high school senior.*", "Would you guys like to hear a knock knock joke by any chance?\n\nhttps://youtu.be/yZClUrmjDVU", "[removed]", "that host was being a straight up dick too lmao. even at the end when the whole crowd somehow cheered at his little seizure of a dance, the host still manages to say \"tough crowd, tough crowd\"", "Thank you for being here today.", "The group is called digital underground", "And it's not pronounced with an \"umpty\".", "with a teenaged 2Pac", "I know every word to this song.", "Oh, so you're the one who said just grab em in the biscuits.", "They also told you that they like to bite.", "You know this group (Digital Underground) is where 2 PAC got his start? He was a dancer and backup rapper for the band.\n\nHere is an early one with 2 pac rapping in digital underground https://youtu.be/CmFDyZ3ytg8", "Anyone know the song? I’m digging it", "Digital Underground - Humpty Dance", "Thanks!", "Aww, poor little plucker. At least it can still enjoy the music.", "If you look at the source of this (OP linked the original video) he's a rescue who came from a really rough background and was fostered then adopted from a parrot rescue.\n\n[https://www.youtube.com/channel/UCxQFqAv73RNj81FglQtOAvg/about](https://www.youtube.com/channel/UCxQFqAv73RNj81FglQtOAvg/about)", "bless those people", "Oh good! I don't know a lot about birds, but I know feather plucking is a sign of stress. I'm glad he's out of that situation and hopefully looks better now.", "I saw that in the comments and am happy he found a good, happy home.", "r/PartyParrot", "Party-parrot!\nYeah, Fowl Play music, in full effect!\nThat's me, Polly, The Brain Supreme, and my man Steve Crowin!", "You can see him plucking in between dance moves:(", "Isn't he just grooming himself there?", "Birds that experience a lot of stress can overgroom to the point of pulling out their own feathers. It sounds like from the comment below this bird was rescued from a bad situation and has kept its unfortunate plucking habit.", "True true, but the moment in the video the comment I reacted to was talking about it looked more like a quick harmless groom to me. He didn't seem to pull out any feathers there? I'm not experienced with these type of birds, only with chickens, so I could be wrong", "I agree it didn't seem to pluck any there. It's just the reflex interrupting the dance combined with the evidence of plucking is a very \"aw poor thing\" moment for people familiar with it.", "Whether he actually removed a feather or not, the behavior looks like a stereotype. I have an even more naked chicken and he exhibits a similar behavior when he's getting attention. Sometimes he plucks, sometimes not. Unfortunately it's a well ingrained habit at this point and there's not a lot you can do to change it. Just got to try and give them the best life you can, now!", "He's exhibiting to proper response someone is to give whenever \"The Humpty Dance\" is currently bangin.", "Is that the funky Chicken?", "Only to Kaladin Stormblessed", "Airsick lowlander.", "Sick reference bro", "Wait, I missed the chicken reference... Damn. Do I need to go back and read it all from book 1 again?", "I think it's just that on Roshar they call all birds chickens.", "Nice crempost.", "Fun fact, Tupac was a backup dancer for this group Digital Underground and he looked very much like this bird.", "You can watch a horrible Chevy Chase movie called Nothing But Trouble and see Digital Underground with Tupac perform in it.  Just throwing this gem out there for everyone!", "Not just Chevy Chase though. Written and directed by Dan Ackroyd who plays two characters. John Candy who plays two characters. And Demi Moore who does not play two characters. I love that movie. One of my favorite bonkers comedies.", "Not related to anything but John Candy actually went to the high school that I went to.  They've got a whole wing dedicated of the building dedicated to him called the Candy Wing", "I always heard he was a great guy in real life", "Very much so.  Too good for this world", "The dick nose scene stuck with me forever. Very odd movie though.", "Yzz my fav the reviews on imdb are like 'this movie felt like a nightmare'.  I feel like im accepting an award when i start making someone watch a terrible deranged movie", "My roommate forced me to watch Son in Law with Pauly Shore not too long ago. Wonder if that was how he felt while I was cringing out of my skin on the couch next to him the whole time lol", "Goin overboard still", "Yes. Back in the day, at the height of Sandlerism, I used to put that on at the house during parties and talk it up as his little known first movie. Sometimes, if people were drunk enough, they would laugh at it.", "Maybe I'm forgetting something as I saw that movie in my youth and not as an adult but I freaking love that movie! Scandalous! doesn't he say that? Now I feel like he definitely doesn't stay that and I don't know why I'm thinking that lol", "It’s peak Demi Moore too. She’s really hot in this movie.", "I love that movie", "Dan Ackroyd used to scare the shit out of me in that movie. The nose.", "And Eazy-E and Dr.Dre", "Welcome to supper! How bout a nice hawaiian punch?", "https://www.youtube.com/watch?v=CmFDyZ3ytg8", "Horrible movie, nah it’s a classic. Though as a child I found it terrifying", "I enjoyed that campy movie and remember when it came out.", "After a long day on the road, there's nothing like a tall glass of warm Hawaiian Punch.", "And some ants on a log, followed by a limp hot dog. \"Go on! Fix 'em up like I doooooo!\"", "You mean a very well put together documentary about the hazards and consequences of road safety and inbreeding.", "Somebody has to pay for the way they sapped this ground!!", "Your face is horrible! *Nothing But Trouble* is fucking great! That's why I never let a banker go!", "I'm not a banker, I'm a financial publisher.", "I believe the song in which he performs was the first time he actually rapped on a song as well.", "Somehow that movie was a staple growing up. It was scary/ unsettling .... and it was on HBO etc. like 4 times a week.", "I used to watch that on cable during the day.  Like Comedy Central I think?   They played it often. It always freaked me out.", "Was he, perhaps, a toucan?\n\nI’m sorry. I had to.", "Tucan - My Ambitions as a Flyer", "You toucan be a backup dancer if you want it bad enough", "This might be your big beak through!", "Holly crap, I've been a fan of digital underground since I was in highschool in the 90's, I had no idea 2pac was their backup singer. This is crazy, just watched their video from the Chevy Chase  movie and sure enough, there it was. I have no idea how I didn't know that. Thanks for this really cool bit of hip hop trivia.", "Check out the live version of Humpty Dance on YouTube. Tupac is the hype man in red.", "I wish he still clowned with the underground.", "He also did backup vocals and  rapped. He was featured on [Same Song ](https://youtu.be/CmFDyZ3ytg8)\n\n(Skip to 2:20 for his bars)", "Another fun fact, the guy rapping (Flock G) produced Toucan's first single \"I Fly Around\"", "Was jumping on here to correct your typo and then said... oh I get it.", "Flock G the one who put the satin on your panties?", "As per ece_guy, OP got the vid from online and is not their bird :\n\n\"First of all, here's that channel's description:\n\n\"Hi!  My name is griffi and welcome to my channel!  I am a goffins cockatoo and I just love to dance.   My mommy and daddy are fosters for the Florida Parrot Rescue and loved me so much they couldn't let me go so I became a permanent part of the family!  I have 3 doggie siblings and another bird sibling (but she's bossy and doesn't like it when I get attention) but I don't care as long as I get to dance! I had a pretty rough life before the rescue got me which is why I look the way I do but I still stay happy!  Looks aren't everything and I know I dance better than most so I don't care! I hope you enjoy my channel and be sure to check back often for more of my slick moves! Oh and P.S.  please go visit my friends who are still looking for their forever families at https://floridaparrotrescue.com/\"", "Those intros “from” each of the birds are adorable.", "What is the bird \\*actually\\* doing?  Is it really dancing?", "Yup, my cockatiel used to create his own songs and dance to them XD", "Yup. Some birbs have a favorite song. You can see a lot of videos like this one on youtube.", "I'd be really curious how many animals can understand and enjoy music, and why that even evolved? There's not a lot of animals that seem to respond to music. Only thing I could imagine is that it's related to intelligence and complex speech, things birds and humans share.", "There’s a lot of things that go into music. Animals like birds that have brains tuned into noise are able to understand some of it, but they have a limited comprehension of beat (how you can tap along to a song). They understand pitch, but they don’t hear octaves as being the same note just higher or lower from what we know.\n\nSo it seems like a lot of it has to do with speech and pattern recognition. Here’s a short video on the topic: https://youtu.be/5NfLKoq9PeA", "I know cats can enjoy music, but from what I understand it’s more about the repetitive and calming vibrations. So rock is not their jam.", "Isn’t that basically what humans enjoy about music also?", "Humans enjoy pattern recognition and the communication of emotions and stories within music. So yes, similar to humans in some ways, though they're unlikely to get the whole emotions and stories bit.", "There was a study with monkeys and a few other animals where they would play classical music in one room, and rock music in the other, and all the animals would choose the room with classical music.\n\nBut when given a room with classical music or silence, the animals chose the silent room.", "Used to keep budgies for years. I had one in particular, Neville, would go crazy for nicky minaj - Super bass. Not dancing, but singing and lots of flapping if not flying in circles. Birds are amazing pets if you spend time with them", "Finding out what mine likes over the years has been a fun adventure. She loves when I just barely whisper, so I’ll often read my textbooks out loud for her. She doesn’t do the same when I’m in calls and she can hear other people talking normally, just when I whisper. She likes certain songs and I’ll play them for her. Nothing that’s gotten her flying in circles unfortunately, but maybe one day haha!", "I once had a bird who loved \"brown girl in the ring\". he'd slide back and forth along his top perch and make the cutest noises. was adorable to watch.", "Yes! My parents had a bunch of rescue animals (licensed). We had a parrot that would sing and dance the night away. She loved, and I mean LOVED, Jamaican music. We also had a rescue pigeon that would look at her like she was crazy while she was jamming out", "Yes. Parrots tend to like music and dance to it.", "Yes, cockatoos love to dance.  Many will start as soon as they hear music. They do not make good pets for many reasons, but they are amazing creatures.", "Ornithologists of Reddit; where are its feathers? Is it actually dancing?", "Yes it’s actually dancing, lots of birds love music! It’s a rescue bird that was suffering from stress plucking. It’s a condition where birds living in stressful or unenriched environments will pluck out their own feathers.", "Poor bb :( nice moves though!", "Someone else says bb besides me", "Awwww.  Is that what he’s doing four seconds in — does he start plucking at his feathers there or is he just giving himself a quick clean?", "That was just adjusting the feathers that are left. Probably poked him while dancing. He actually has a bunch of new fluff growing in so he may grow back more feathers over time if he has stopped plucking.", "This little guy got STYLE. Party on!", "You should check out r/partyparrot", "Yes! One of my favorite subreddits!", "Poor, stressed little bird.", "iirc, this bird is a rescue and is as happy as can be now.\n\nEdit: here's the link [happy rescue birb](https://youtu.be/bPTFoOK09iw)\n\nThnk you u/Do_Not_Go_In_There for finding it.", "You can tell it is coming up from a very stressful past because of all the new growth. \n\nAll the little fuzz that looks like cotton? New growth and “little buddy” is recovering. \n\nPeople should be happy to see it happy and enjoying itself. Means a much better life.", "Thank you for this. I was initially worried about the little fella.", "Yeah he was once pretty stressed.", "I was about to say this looks like a rescue. You can tell by how comfortable the bird is around the camera person.", "I’m happy that this birb is happy and I love him.", "yeah, it's unfortunate but even after rescues are in a nice home with a loving family, they still pluck. it's like biting your fingernails, you just kinda do it whenever you're not focusing.", "That's not always true", "of course, same as it isnt for nail biters, but it can be.", "This is the comment I wanted to read and I won't be looking any further into this", "It's a rescue bird, he seems to be doing okay: https://www.youtube.com/watch?v=bPTFoOK09iw", "You made my morning, lol.", "Just what I needed", "“Big bag of seeds for me”", "\"Aquaphobiaaaa!\"", "Moves: Yes. Feathers: Not so much.", "Song is called: The Humpty Dance - by Digital Underground", "A bird can literally dance better than me", "Who else was bobbing their head along with the birb", "I dunno if anyone is as fascinated by this as I am (IRL I err on the side of thinking not) but here is a great article discussing this capacity to \"keep the beat\" by birds that also talk/vocalize: [https://www.nationalgeographic.com/science/article/alex-the-parrot-and-snowball-the-cockatoo-show-that-birds-can-dance#:\\~:text=Both%20groups%20of%20researchers%20believe,hearing%20and%20their%20motor%20functions](https://www.nationalgeographic.com/science/article/alex-the-parrot-and-snowball-the-cockatoo-show-that-birds-can-dance#:~:text=Both%20groups%20of%20researchers%20believe,hearing%20and%20their%20motor%20functions).\n\nAnd I hope this birb is on the mend and not in the same hands that stressed him out!", "Poor baby, he’s plucked himself all the way as far as he could reach. Wonder what went wrong in his life to make him start that...I have an Eclectus rescue who started plucking after her human up and left her, but she mainly plucks on her body, not on wings and tail. Once they start it’s almost impossible to get them to stop just like a human biting their nails or picking scabs, it gives them a bit of an endorphin rush that is hard to get rid of. My Ruby has the best of everything, fresh fruits n veggies, organic tea and beans for sprouts, nuts for soaking, everything top of the hill for humans,too...she even has her own room with jungle gyms and such, but most of the time she’s on my shoulder, gets all the cuddles she wants...but none of all that makes her stop plucking, it makes you want to cry. So yes, they look goofy when they dance like all crazy looking, to me it’s just sad. ?", "If you look at the source of this (OP linked the original video) he's a rescue who came from a really rough background and was fostered then adopted from a parrot rescue.\n\n[https://www.youtube.com/channel/UCxQFqAv73RNj81FglQtOAvg/about](https://www.youtube.com/channel/UCxQFqAv73RNj81FglQtOAvg/about)", "This is me when I am home alone", "Moves like Jagger - body like Jagger", "That cross body head tuck under the wing gave me goosebumps", "Reminds me of Baby Groot at the beginning of GOTG2", "My nose is big, big like a pickle in the 69 my  nose will tickle your rear.. ...", "u/savevideo", "This bird got moves, thanks OP for rescuing him ( I assume), need more dance videos!", "Movin like bernie", "Aw!! What a cutie! Loves the music! Hope it feels better soon!", "Someone get that bird on ‘So you think you can dance?’ Already!", "I wish I had an award to give to a parrot doing the Humpty Dance", "The birds name isn't Cotton by chance is it?", "Need some more feathers little man. Quit picking & keep on dancing. Woo hoo", "Tupac reincarnated", "I hope this little guy has gotten some tlc", "The thug life chose him", "Bird has good taste" ],
      "Id": "lugo9n",
      "Submission Name": "Kid's got moves"
    },
    {
      "Score": 6424,
      "Comments": [ null, "Why does that baby look like he's 48 years old and smokes two packs a day?", "The face he's making looks like he's ready to spit out his chewing tobacco", "That baby would be perfect for r/oldbabies", "I was so distracted by the ugly baby I didn’t even see the dog until reading the comments", "Danny DeVidog", "Somebody said that all babies look like Winston Churchill, and I agree", "Baby is taking a dump, while watching his mother in the eyes. Baby powerplay.", "Demonic child", "If Netflix was making Mandalorian this would be baby Yoda", "Take my upvote you've earned it", "Hmmmm, yes. made a poopy I did", "BBY Grogu <3", "I was thinking his Albino cousin", "fart, i must", "That is a very ugly baby, with or without the dog ears", "Dude looks more like baby Yoda than baby Yoda.", "Breathtaking", "Well positioned Seinfeld reference...", ";)", "Why is there a baby in r/aww", "Because babies are cute", "Ew no. Especially not this one.", "I came here thinking that there was only\nGonna be adorable animals", "it's not called \"cute animals,\" it's just \"aww\".", "Well you thought wrong", "Go away satan", "They’re really not.", "Satan", "For a split second I thought it was a baby heihachi mishima.", "Renaissance painting", "Bleach my eyes please, that baby’s face is so disturbing...", "he got that sideways Marge Simpson though", "The eyes lol", "Judge me by my size, do you?", "THIS RAISES SO MANY QUESTIONS!!", "Woooooow :D I'll share this picture with my friends! :D\n\nYou're so amazing pals!", "That baby looks like he’s already dealing with bills", "Batman prequel", "Looks like a Homunculus, such as baby Jesus in paintings from the dark age.", "If you flipped your phone upside down, that armpit will turn in to a butt crack\n\nSource : I've watched too many \"how dirty is your mind\" vids on youtube, I can spot that shit from miles away", "Where is there a dog in the picture? I only see the woman and the Baby who has Furry dog ears for no reason (Its a Joke ok dont get mad at me)", "Those scientists in Japan succeeded!", "Baby Yoda", "Haha funny", "Ah, the real baby yoda", "Looks like Jack Nicholson", "Thats baby yoda irl", "Looks like a baby Yogurt from Space Balls 3: The Search for Space Balls 2: The Search for More Money.", "He's not his mom's eyes, his dad's chins, the the dogs ears (and possibly tail.)", "And that, my children, is how *Batman Begins*", "r/13or30", "Kid's probably grown up with a kid of his own now.", "why the baby look like that", "This is the way", "Spawn of Yoda.", "Cat girls have never been closer", "If babies had ears like that, I would of had one a long time ago.", "Batboy.... Lives.", "Why do baby look high????!!!???!!?", "Next season of Mandalorian, baby Yoda faces off against his arch nemesis... Baby palpatine!", "Master of photobombs are dogs", "Bat baby", "you should post this picture on r/hmmm", "There you are my little Padawan", "Ah yes, Anubis", "My what big ears you have!", "This is the society that furries want", "*”Big brother Ed? Can we play now? Can we play?”*", "This baby is so sweet.", "That’s a great pic ... looks like baby has pup ears lol", "He'll grow up to be a great weeb one day", "Nah man he gonna grow up to be batman", "?????" ],
      "Id": "lumenn",
      "Submission Name": "Dogs are the masters of photobombs!!"
    }
  ]
}